-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Apr 05, 2026 at 10:38 AM
-- Server version: 10.4.32-MariaDB
-- PHP Version: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `educationportal_new`
--

-- --------------------------------------------------------

--
-- Table structure for table `access_roles`
--

CREATE TABLE `access_roles` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(50) NOT NULL,
  `slug` varchar(50) NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `access_roles`
--

INSERT INTO `access_roles` (`id`, `name`, `slug`, `created_at`, `updated_at`) VALUES
(1, 'Student', 'student', '2026-02-18 05:57:32', '2026-02-18 05:57:32'),
(2, 'Teacher', 'teacher', '2026-02-18 05:57:32', '2026-02-18 05:57:32'),
(3, 'Admin', 'admin', '2026-02-18 05:57:32', '2026-02-18 05:57:32');

-- --------------------------------------------------------

--
-- Table structure for table `access_role_user`
--

CREATE TABLE `access_role_user` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED NOT NULL,
  `access_role_id` bigint(20) UNSIGNED NOT NULL,
  `assigned_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `access_role_user`
--

INSERT INTO `access_role_user` (`id`, `user_id`, `access_role_id`, `assigned_at`) VALUES
(1, 1, 1, '2026-02-18 05:59:02'),
(2, 1, 2, '2026-02-18 05:59:02');

-- --------------------------------------------------------

--
-- Table structure for table `cache`
--

CREATE TABLE `cache` (
  `key` varchar(255) NOT NULL,
  `value` mediumtext NOT NULL,
  `expiration` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `cache`
--

INSERT INTO `cache` (`key`, `value`, `expiration`) VALUES
('laravel-cache-boost.roster.scan', 'a:2:{s:6:\"roster\";O:21:\"Laravel\\Roster\\Roster\":3:{s:13:\"\0*\0approaches\";O:29:\"Illuminate\\Support\\Collection\":2:{s:8:\"\0*\0items\";a:0:{}s:28:\"\0*\0escapeWhenCastingToString\";b:0;}s:11:\"\0*\0packages\";O:32:\"Laravel\\Roster\\PackageCollection\":2:{s:8:\"\0*\0items\";a:6:{i:0;O:22:\"Laravel\\Roster\\Package\":6:{s:9:\"\0*\0direct\";b:1;s:13:\"\0*\0constraint\";s:5:\"^12.0\";s:10:\"\0*\0package\";E:37:\"Laravel\\Roster\\Enums\\Packages:LARAVEL\";s:14:\"\0*\0packageName\";s:17:\"laravel/framework\";s:10:\"\0*\0version\";s:7:\"12.52.0\";s:6:\"\0*\0dev\";b:0;}i:1;O:22:\"Laravel\\Roster\\Package\":6:{s:9:\"\0*\0direct\";b:0;s:13:\"\0*\0constraint\";s:7:\"v0.3.13\";s:10:\"\0*\0package\";E:37:\"Laravel\\Roster\\Enums\\Packages:PROMPTS\";s:14:\"\0*\0packageName\";s:15:\"laravel/prompts\";s:10:\"\0*\0version\";s:6:\"0.3.13\";s:6:\"\0*\0dev\";b:0;}i:2;O:22:\"Laravel\\Roster\\Package\":6:{s:9:\"\0*\0direct\";b:0;s:13:\"\0*\0constraint\";s:6:\"v0.5.9\";s:10:\"\0*\0package\";E:33:\"Laravel\\Roster\\Enums\\Packages:MCP\";s:14:\"\0*\0packageName\";s:11:\"laravel/mcp\";s:10:\"\0*\0version\";s:5:\"0.5.9\";s:6:\"\0*\0dev\";b:1;}i:3;O:22:\"Laravel\\Roster\\Package\":6:{s:9:\"\0*\0direct\";b:1;s:13:\"\0*\0constraint\";s:5:\"^1.24\";s:10:\"\0*\0package\";E:34:\"Laravel\\Roster\\Enums\\Packages:PINT\";s:14:\"\0*\0packageName\";s:12:\"laravel/pint\";s:10:\"\0*\0version\";s:6:\"1.27.1\";s:6:\"\0*\0dev\";b:1;}i:4;O:22:\"Laravel\\Roster\\Package\":6:{s:9:\"\0*\0direct\";b:1;s:13:\"\0*\0constraint\";s:5:\"^1.41\";s:10:\"\0*\0package\";E:34:\"Laravel\\Roster\\Enums\\Packages:SAIL\";s:14:\"\0*\0packageName\";s:12:\"laravel/sail\";s:10:\"\0*\0version\";s:6:\"1.53.0\";s:6:\"\0*\0dev\";b:1;}i:5;O:22:\"Laravel\\Roster\\Package\":6:{s:9:\"\0*\0direct\";b:1;s:13:\"\0*\0constraint\";s:7:\"^11.5.3\";s:10:\"\0*\0package\";E:37:\"Laravel\\Roster\\Enums\\Packages:PHPUNIT\";s:14:\"\0*\0packageName\";s:15:\"phpunit/phpunit\";s:10:\"\0*\0version\";s:7:\"11.5.53\";s:6:\"\0*\0dev\";b:1;}}s:28:\"\0*\0escapeWhenCastingToString\";b:0;}s:21:\"\0*\0nodePackageManager\";E:43:\"Laravel\\Roster\\Enums\\NodePackageManager:NPM\";}s:9:\"timestamp\";i:1773926321;}', 1774012721);

-- --------------------------------------------------------

--
-- Table structure for table `cache_locks`
--

CREATE TABLE `cache_locks` (
  `key` varchar(255) NOT NULL,
  `owner` varchar(255) NOT NULL,
  `expiration` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `exams`
--

CREATE TABLE `exams` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `title` varchar(255) NOT NULL,
  `code` varchar(255) NOT NULL,
  `duration` int(11) DEFAULT NULL COMMENT 'Duration in minutes',
  `marks_per_question` bigint(30) NOT NULL,
  `negative_mark_id` bigint(30) NOT NULL,
  `total_mark` decimal(6,2) DEFAULT 0.00,
  `pass_mark` decimal(6,2) DEFAULT NULL,
  `number_of_question_want_to_add` bigint(30) NOT NULL,
  `watermark_text` varchar(255) DEFAULT NULL,
  `created_by` bigint(20) UNSIGNED NOT NULL,
  `status` enum('draft','published','archived') DEFAULT 'draft',
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `exams`
--

INSERT INTO `exams` (`id`, `title`, `code`, `duration`, `marks_per_question`, `negative_mark_id`, `total_mark`, `pass_mark`, `number_of_question_want_to_add`, `watermark_text`, `created_by`, `status`, `created_at`, `updated_at`) VALUES
(8, 'test', 'X9F10P', 10, 1, 2, 30.00, NULL, 30, NULL, 1, 'published', '2026-03-17 09:26:38', '2026-03-19 06:39:04'),
(9, 'বাংলা : সমর্থক শব্দ , বিপরীত শব্দ ও পরিভাষা', 'IYJRMS', 2, 1, 2, 30.00, NULL, 30, NULL, 1, 'published', '2026-03-17 09:37:56', '2026-04-04 21:41:35');

-- --------------------------------------------------------

--
-- Table structure for table `exam_answers`
--

CREATE TABLE `exam_answers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `exam_id` bigint(20) UNSIGNED NOT NULL,
  `question_id` bigint(20) UNSIGNED NOT NULL,
  `correct_answer` text DEFAULT NULL,
  `explanation` text DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `exam_questions`
--

CREATE TABLE `exam_questions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `exam_id` bigint(20) UNSIGNED NOT NULL,
  `question_id` bigint(20) UNSIGNED NOT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `exam_questions`
--

INSERT INTO `exam_questions` (`id`, `exam_id`, `question_id`, `created_at`) VALUES
(11, 8, 6, '2026-03-17 18:45:13'),
(12, 8, 10, '2026-03-17 18:45:13'),
(15, 9, 6, '2026-03-18 06:57:38'),
(16, 9, 7, '2026-03-18 06:57:38'),
(17, 9, 3, '2026-03-18 07:00:23'),
(18, 9, 4, '2026-03-18 07:00:23'),
(19, 9, 5, '2026-03-18 07:00:23'),
(20, 9, 8, '2026-03-18 07:00:23'),
(21, 9, 9, '2026-03-18 07:00:23'),
(22, 9, 21, '2026-03-18 07:01:02'),
(23, 9, 22, '2026-03-18 07:01:02'),
(24, 9, 23, '2026-03-18 07:01:02'),
(25, 9, 24, '2026-03-18 07:01:02'),
(26, 9, 25, '2026-03-18 07:01:02'),
(27, 9, 26, '2026-03-18 07:01:02'),
(28, 9, 27, '2026-03-18 07:01:02'),
(29, 9, 29, '2026-03-18 07:01:02'),
(31, 8, 91, '2026-03-18 07:14:28'),
(32, 8, 92, '2026-03-18 07:14:28'),
(33, 8, 93, '2026-03-18 07:14:28'),
(34, 8, 94, '2026-03-18 07:14:28'),
(35, 8, 95, '2026-03-18 07:14:28'),
(36, 8, 96, '2026-03-18 07:14:28'),
(37, 8, 97, '2026-03-18 07:14:28'),
(38, 8, 98, '2026-03-18 07:14:28'),
(39, 8, 99, '2026-03-18 07:14:28'),
(40, 8, 100, '2026-03-18 07:14:28');

-- --------------------------------------------------------

--
-- Table structure for table `exam_settings`
--

CREATE TABLE `exam_settings` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `exam_id` bigint(20) UNSIGNED NOT NULL,
  `header_json` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL COMMENT 'Institute name, exam code, subject' CHECK (json_valid(`header_json`)),
  `footer_json` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL COMMENT 'Page number, signature, note' CHECK (json_valid(`footer_json`)),
  `margin_json` longtext CHARACTER SET utf8mb4 COLLATE utf8mb4_bin DEFAULT NULL COMMENT '{top,bottom,left,right}' CHECK (json_valid(`margin_json`)),
  `answer_style` enum('mcq_tick','written','mixed') DEFAULT 'mcq_tick',
  `answer_view` enum('inline','separate','hidden') DEFAULT 'hidden',
  `question_number_style` enum('1','1.1','a','i') DEFAULT '1',
  `shuffle_questions` tinyint(1) DEFAULT 0,
  `shuffle_options` tinyint(1) DEFAULT 0,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

-- --------------------------------------------------------

--
-- Table structure for table `failed_jobs`
--

CREATE TABLE `failed_jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `uuid` varchar(255) NOT NULL,
  `connection` text NOT NULL,
  `queue` text NOT NULL,
  `payload` longtext NOT NULL,
  `exception` longtext NOT NULL,
  `failed_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `jobs`
--

CREATE TABLE `jobs` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `queue` varchar(255) NOT NULL,
  `payload` longtext NOT NULL,
  `attempts` tinyint(3) UNSIGNED NOT NULL,
  `reserved_at` int(10) UNSIGNED DEFAULT NULL,
  `available_at` int(10) UNSIGNED NOT NULL,
  `created_at` int(10) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `job_batches`
--

CREATE TABLE `job_batches` (
  `id` varchar(255) NOT NULL,
  `name` varchar(255) NOT NULL,
  `total_jobs` int(11) NOT NULL,
  `pending_jobs` int(11) NOT NULL,
  `failed_jobs` int(11) NOT NULL,
  `failed_job_ids` longtext NOT NULL,
  `options` mediumtext DEFAULT NULL,
  `cancelled_at` int(11) DEFAULT NULL,
  `created_at` int(11) NOT NULL,
  `finished_at` int(11) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `migrations`
--

CREATE TABLE `migrations` (
  `id` int(10) UNSIGNED NOT NULL,
  `migration` varchar(255) NOT NULL,
  `batch` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `migrations`
--

INSERT INTO `migrations` (`id`, `migration`, `batch`) VALUES
(1, '0001_01_01_000000_create_users_table', 1),
(2, '0001_01_01_000001_create_cache_table', 1),
(3, '0001_01_01_000002_create_jobs_table', 1);

-- --------------------------------------------------------

--
-- Table structure for table `negative_marks`
--

CREATE TABLE `negative_marks` (
  `id` bigint(20) NOT NULL,
  `marks` decimal(5,2) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `negative_marks`
--

INSERT INTO `negative_marks` (`id`, `marks`, `created_at`, `updated_at`) VALUES
(1, 0.00, '2026-03-17 13:10:11', '2026-03-17 13:10:11'),
(2, 0.25, '2026-03-17 13:10:11', '2026-03-17 13:10:11'),
(3, 0.50, '2026-03-17 13:10:11', '2026-03-17 13:10:11'),
(4, 1.00, '2026-03-17 13:10:11', '2026-03-17 13:10:11');

-- --------------------------------------------------------

--
-- Table structure for table `password_reset_tokens`
--

CREATE TABLE `password_reset_tokens` (
  `email` varchar(255) NOT NULL,
  `token` varchar(255) NOT NULL,
  `created_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

-- --------------------------------------------------------

--
-- Table structure for table `previous_exams`
--

CREATE TABLE `previous_exams` (
  `id` bigint(30) NOT NULL,
  `previous_exam_category_id` bigint(30) NOT NULL,
  `name` text NOT NULL,
  `slug` text DEFAULT NULL,
  `year_id` bigint(30) NOT NULL,
  `status` tinyint(4) NOT NULL,
  `created_by` bigint(30) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `previous_exams`
--

INSERT INTO `previous_exams` (`id`, `previous_exam_category_id`, `name`, `slug`, `year_id`, `status`, `created_by`, `created_at`, `updated_at`) VALUES
(1, 2, 'BCS-48', 'bcs-48', 2, 1, 1, '2026-03-04 17:24:38', '2026-03-04 17:24:38'),
(4, 13, '৫০ তম বিসিএস প্রিলিমিনারি', '50-tm-bisies-priliminari', 3, 1, 1, '2026-03-04 18:47:44', '2026-03-04 18:47:44'),
(5, 13, '৪৯ তম বিশেষ বিসিএস প্রিলিমিনারি (শিক্ষা - Department) - ১০/১০-২০২৫', '49-tm-bisesh-bisies-priliminari-siksha-department-1010-2025', 2, 1, 1, '2026-03-04 18:52:05', '2026-03-04 18:54:03'),
(6, 13, '৪৯ তম বিশেষ বিসিএস প্রিলিমিনারি (শিক্ষা - Non Department) - ১০/১০-২০২৫', '49-tm-bisesh-bisies-priliminari-siksha-non-department-1010-2025', 2, 1, 1, '2026-03-04 18:54:26', '2026-03-04 18:54:26'),
(7, 13, '৪৭ তম বিসিএস প্রিলিমিনারি টেস্ট (19-09-2025)', '47-tm-bisies-priliminari-test-19-09-2025', 2, 1, 1, '2026-03-04 18:56:07', '2026-03-04 18:56:07');

-- --------------------------------------------------------

--
-- Table structure for table `previous_exam_categories`
--

CREATE TABLE `previous_exam_categories` (
  `id` bigint(30) NOT NULL,
  `name` text DEFAULT NULL,
  `slug` text NOT NULL,
  `description` text DEFAULT NULL,
  `status` tinyint(4) NOT NULL,
  `created_by` bigint(30) NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `previous_exam_categories`
--

INSERT INTO `previous_exam_categories` (`id`, `name`, `slug`, `description`, `status`, `created_by`, `created_at`, `updated_at`) VALUES
(1, 'প্রাথমিক প্রধান শিক্ষক নিয়োগ পরীক্ষা', 'prathmik-prdhan-sikshk-niyog-preeksha', NULL, 1, 1, '2026-03-03 15:59:58', '2026-03-04 18:37:07'),
(2, 'প্রাথমিক সহকারী  শিক্ষক নিয়োগ পরীক্ষা', 'prathmik-shkaree-sikshk-niyog-preeksha', NULL, 1, 1, '2026-03-03 16:00:41', '2026-03-04 18:32:05'),
(3, 'মাধ্যমিক  সহকারী শিক্ষক নিয়োগ পরীক্ষা', 'madhzmik-shkaree-sikshk-niyog-preeksha', NULL, 1, 1, '2026-03-04 18:39:03', '2026-03-04 18:39:03'),
(4, 'শিক্ষক নিবন্ধন ও প্রত্যয়ন পরীক্ষা', 'sikshk-nibndhn-oo-prtzyn-preeksha', NULL, 1, 1, '2026-03-04 18:39:45', '2026-03-04 18:39:45'),
(5, 'প্রভাষক নিবন্ধন ও প্রত্যয়ন পরীক্ষা', 'prvashk-nibndhn-oo-prtzyn-preeksha', NULL, 1, 1, '2026-03-04 18:40:21', '2026-03-04 18:40:21'),
(6, 'উপজেলা/থানা শিক্ষা অফিসার', 'upjelathana-siksha-ofisar', NULL, 1, 1, '2026-03-04 18:41:00', '2026-03-04 18:41:00'),
(7, 'পি এস সি ও অন্যান্য নিয়োগ পরীক্ষা', 'pi-es-si-oo-onzanz-niyog-preeksha', NULL, 1, 1, '2026-03-04 18:42:35', '2026-03-04 18:42:35'),
(8, 'সহকারী জজ নিয়োগ পরীক্ষা', 'shkaree-jj-niyog-preeksha', NULL, 1, 1, '2026-03-04 18:43:03', '2026-03-04 18:43:03'),
(9, 'বাংলাদেশ ব্যাংক', 'banglades-bzangk', NULL, 1, 1, '2026-03-04 18:43:30', '2026-03-04 18:43:30'),
(10, 'সমন্বিত ব্যাংক', 'smnwit-bzangk', NULL, 1, 1, '2026-03-04 18:43:55', '2026-03-04 18:43:55'),
(11, 'পেট্রোবাংলা', 'petrobangla', NULL, 1, 1, '2026-03-04 18:45:06', '2026-03-04 18:45:06'),
(12, 'পল্লী কর্ম সহায়ক ফাউন্ডেশন', 'pllee-krm-shayk-faundesn', NULL, 1, 1, '2026-03-04 18:45:30', '2026-03-04 18:45:30'),
(13, 'বিসিএস প্রিলিমিনারি', 'bisies-priliminari', NULL, 1, 1, '2026-03-04 18:46:49', '2026-03-04 18:46:49');

-- --------------------------------------------------------

--
-- Table structure for table `previous_exam_questions`
--

CREATE TABLE `previous_exam_questions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `previous_exam_id` bigint(20) UNSIGNED NOT NULL,
  `question_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `previous_exam_questions`
--

INSERT INTO `previous_exam_questions` (`id`, `previous_exam_id`, `question_id`) VALUES
(1, 4, 340),
(2, 4, 341),
(3, 4, 344),
(4, 4, 327),
(5, 4, 311),
(6, 4, 312),
(7, 4, 315),
(8, 4, 318),
(9, 4, 321),
(10, 4, 324),
(11, 4, 325),
(12, 4, 333),
(14, 1, 329),
(15, 1, 307),
(16, 1, 323),
(17, 1, 347),
(18, 4, 347);

-- --------------------------------------------------------

--
-- Table structure for table `questions`
--

CREATE TABLE `questions` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `category_id` bigint(20) UNSIGNED DEFAULT NULL,
  `question_text` text NOT NULL,
  `description` text DEFAULT NULL,
  `correct_option` varchar(255) NOT NULL,
  `created_by` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `questions`
--

INSERT INTO `questions` (`id`, `category_id`, `question_text`, `description`, `correct_option`, `created_by`, `created_at`, `updated_at`) VALUES
(1, 11, 'বাংলা ভাষার উদ্ভব হয়েছে নিম্নোক্ত একটি ভাষা থেকে ------', NULL, '2', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(2, 11, 'বাংলা ভাষার উদ্ভব হয়েছে নিম্নোক্ত কোন ভাষা থেকে?', NULL, '2', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(3, 11, 'বাংলা ভাষার উদ্ভব হয়েছে কোন ভাষা থেকে?', NULL, '2', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(4, 11, 'বাংলা ভাষার উদ্ভব হয়েছে নিচের কোন ভাষা হতে?', NULL, '0', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(5, 11, 'ড. মুহম্মদ শহীদুল্লাহর মতে বাংলা ভাষার উদ্ভব ---', NULL, '1', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(6, 11, 'বাংলা ভাষার উদ্ভব হয়-', NULL, '0', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(7, 11, 'কোন ভাষা থেকে বাংলা ভাষার উদ্ভব হয়েছে বলে ড. মুহম্মদ শহীদুল্লাহ মনে করেন?', NULL, '3', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(8, 11, 'বাংলা ভাষার উদ্ভব হয়েছে নিম্নোক্ত কোন ভাষা থেকে?', NULL, '2', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(9, 11, 'বাংলা ভাষার উদ্ভব নিম্নোক্ত একটি ভাষা থেকে-', NULL, '2', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(10, 11, 'কোন ভাষা হতে বাংলা ভাষার উদ্ভব হয়েছে?', NULL, '1', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(11, 11, 'বাংলা ভাষার উদ্ভব হয়েছে_____ ভাষা থেকে।', NULL, '0', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(12, 11, 'বাংলা ভাষার উদ্ভব হয়েছে নিচের কোন ভাষা থেকে ?', NULL, '1', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(13, 11, 'ইন্দো ইউরোপীয় ভাষার কয়টা শাখা?', NULL, '0', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(14, 11, 'বাংলা ভাষার বয়স কত?', NULL, '1', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(15, 11, 'বাংলা ভাষার জন্ম হয়েছে মাগধী প্রাকৃত থেকে - এ মতের প্রবক্তা কে?', NULL, '3', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(16, 11, 'বাংলা ও মৈথিলি ভাষার সংমিশ্রনে তৈরি এক প্রকার কৃত্রিম ভাষা হলো-', NULL, '3', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(17, 11, 'বাংলা ভাষা ও সাহিত্য কার কাছে প্রত্যক্ষভাবে ঋণী?', NULL, '2', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(18, 11, 'বাংলা ভাষা উদ্ভব ইন্দো-ইউরোপীয় ভাষার কোন শাখা থেকে ?', NULL, '0', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(19, 11, 'ডঃ মুহাম্মদ শহীদুল্লাহর মতে বাংলা ভাষার উৎপত্তি', NULL, '0', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(20, 11, 'জর্জ গ্রিয়ার্সন ও ডক্টর সুনীতিকুমার মতে বাংলা ভাষার উৎপত্তি', NULL, '1', NULL, '2026-03-05 08:41:17', '2026-03-05 08:41:17'),
(21, 18, 'বাংলা লিপির উদ্ভব হয়েছে কোন প্রাচীন লিপি থেকে?', NULL, '3', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(22, 18, 'বাংলা লিপির উৎস কি?', NULL, '3', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(23, 18, 'বাংলা লিপির উৎপত্তি কোন লিপি থেকে?', NULL, '1', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(24, 18, 'বাংলা লিপির উৎস -', NULL, '1', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(25, 18, 'বাংলা লিপির উদ্ভব হয়েছে কোন প্রাচীন লিপি থেকে?', NULL, '3', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(26, 18, 'বাংলা লিপির উৎস কি?', NULL, '3', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(27, 18, 'কোন প্রাচীন লিপি থেকে বাংলা লিপির উদ্ভব হয়েছে ?', NULL, '2', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(28, 18, 'বাংলা লিপির উৎস?', NULL, '3', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(29, 18, 'বাংলা লিপির উদ্ভব ব্রাহ্মী লিপির কোন শাখা থেকে ?', NULL, '1', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(30, 18, 'বাংলা লিপির উৎস কী?', NULL, '3', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(31, 18, 'কোন সম্রাট তার শাসনমালা ব্রাহ্মী লিপিতে উৎকীর্ণ করান?', NULL, '0', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(32, 18, 'বাংলা লিপির উৎস-', NULL, '3', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(33, 18, 'দশম শতকের কোন লিপি থেকে বাংলা লিপি এসেছে?', NULL, '1', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(34, 18, 'কোন আমলে ব্রাহ্মী লিপিতে কিছু কিছু পরিবর্তন দেখা যায়?', NULL, '1', NULL, '2026-03-05 08:52:13', '2026-03-05 08:52:13'),
(35, 9, '\"চর্যাপদ\" কোথা থেকে আবিষ্কৃত হয়েছে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(36, 9, '\'চর্যাপদ\' কোন ধর্মাবলম্বীদের সাহিত্য ?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(37, 9, 'বাংলা সাহিত্যের ইতিহাসে প্রথম গ্রন্থ কোনটি?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(38, 9, 'কোন রাজবংশের আমলে চর্যাপদ রচনা শুরু হয়?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(39, 9, '\'চর্যাপদ\' প্রথম কোথা থেকে প্রকাশিত হয়?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(40, 9, 'বাংলা ভাষার প্রথম কাব্য সংকলন \'চর্যাপদ\' --এর আবিষ্কারক----', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(41, 9, 'চর্যাপদ কোথা থেকে আবিস্কৃত হয়?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(42, 9, '\'চর্যাপদে\' কার পদ সবচেয়ে বেশি?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(43, 9, 'বাংলা সাহিত্যের প্রাচীনতম নিদর্শন কোনটি?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(44, 9, 'চর্যাপদ আবিষ্কৃত হয় কোথা থেকে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(45, 9, 'বাংলা ভাষার আদি নিদর্শন চর্যাপদ আবিষ্কৃত হয় কত সালে?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(46, 9, 'চর্যাপদ কোন ছন্দে লেখা ?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(47, 9, '\' চর্যাপদ\' কত সালে আবিষ্কৃত হয়?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(48, 9, 'সবচেয়ে বেশি চর্যাপদ পাওয়া গেছে কোন কবির?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(49, 9, 'চর্যাপদে কতজন কবির পদ রয়েছে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(50, 9, 'চর্যাপদে সবচেয়ে বেশি পদ রচনা করে -', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(51, 9, 'ড. মুহম্মদ শহীদুল্লাহর মতে, চর্যাপদের ভাষা-', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(52, 9, 'ড. মুহম্মদ শহীদুল্লাহ্‌ সম্পাদিত চর্যাপদ বিষয়ক গ্রন্থের নাম কী?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(53, 9, 'চর্যাপদে কোন পদটি খণ্ডিত আকারে পাওয়া গেছে?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(54, 9, 'বাংলা সাহিত্যের আদি নিদর্শন -', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(55, 9, 'বাংলা সাহিত্যের প্রাচীনতম নির্দশন ”চর্যাপদ” পাওয়া যায়‘', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(56, 9, 'চর্যাপদ আবিষ্কার হয় কোন দেশ থেকে?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(57, 9, 'চর্যাপদ একপ্রকার-', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(58, 9, 'চর্যাপদ কোন ধর্মাবলম্বীদের সাহিত্য ?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(59, 9, 'চর্যাপদ প্রথম কোথা থেকে প্রকাশিত হয়?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(60, 9, 'বঙ্গীয় সাহিত্য পরিষদ কর্তৃক প্রকাশিত চর্যাপদ কে সম্পাদনা করেন?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(61, 9, '”চর্যাপদ” এর পুঁথি আবিস্কৃত হয়-', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(62, 9, 'কোন পন্ডিত চর্যাপদের পদগুলো টীকার মাধ্যমে ব্যাখ্যা করেন?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(63, 9, 'চর্যাপদ যে বাংলা ভাষায় রচিত এটি প্রথম কে প্রমাণ করেন ?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(64, 9, 'চর্যাপদের আবিষ্কারের কাল-', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(65, 9, 'চর্যাপদে কোন কবি সবচেয়ে বেশি পদ রচনা করেছেন?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(66, 9, 'চর্যাপদের আবিষ্কার কাল কত?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(67, 9, 'বাংলা সাহিত্যের আদি নিদর্শন “চর্যাপদ” কে আবিষ্কার করেন?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(68, 9, '”চর্যাপদ” কোন ছন্দে লেখা?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(69, 9, 'বাংলা সাহিত্যের প্রথম নিদর্শন চর্যাপদে প্রাপ্ত পদের সংখ্যা', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(70, 9, 'চর্যাপদের আদি কবি-', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(71, 9, 'কোন পণ্ডিত চর্যাপদের পদ্গুলো টীকার মাধ্যমে ব্যাখ্যা করেন?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(72, 9, 'বাংলা ভাষার প্রথম কাব্য সংকলন \'চর্যাপদ\' -এর আবিষ্কারক-', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(73, 9, 'চর্যাপদের আবিষ্কারক কে?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(74, 9, 'চর্যাপদের কোন পদকর্তা সবচেয়ে বেশি পদ রচনা করেছেন?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(75, 9, 'চর্যাপদ আবিষ্কৃত হয়--', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(76, 9, 'চর্যাপদ আবিষ্কৃত হওয়ার স্থান -', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(77, 9, 'চর্যাপদের সাথে কোন ধর্মের নাম সংশ্লিষ্ট?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(78, 9, 'চর্যাপদের পদগুলো মূলত-', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(79, 9, '”চর্যাপদ” কোথা থেকে আবিষ্কার করা হয়?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(80, 9, 'চর্যাপদের কবিগণের মধ্যে সর্বাধিক পদরচয়িতার গৌরবের অধিকারী-', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(81, 9, '”চর্যাপদ” আবিষ্কৃত হয় কত সালে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(82, 9, '\'চর্যাপদ\' কোন ধর্মাবলম্বীদের সাহিত্য?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(83, 9, 'বাংলা সাহিত্যের আদি গ্রন্থ “চর্যাপদ”-এর রচনাকাল-', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(84, 9, 'চর্যাপদের কবির সংখ্যা কতজন?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(85, 9, 'চর্যাপদের পান্ডুলিপি কে আবিষ্কার করেন?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(86, 9, 'কোন পন্ডিত চর্যাপদের পদগুলি টীকার মাধ্যামে ব্যাখ্যা করেন?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(87, 9, 'কোন পন্ডিত চর্যাপদের পদগুলো টীকার মাধ্যমে ব্যাখ্যা করেন?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(88, 9, '’চর্যাপদ’ রচনাটি বাংলা সাহিত্যে কোন যুগের কাব্য নিদর্শন?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(89, 9, 'চর্যাপদ কে আবিষ্কার করেন?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(90, 9, 'চর্যাপদ এক প্রকার-', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(91, 9, 'কোন শাসনামলে চর্যাপদ রচিত হয়েছিলো?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(92, 9, 'চর্যাপদের কবির সংখ্যা কতজন ?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(93, 9, 'বাংলা সাহিত্যের প্রাচীনতম নিদর্শন \'চর্যাপদ\' কোন ছন্দে রচিত?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(94, 9, 'চর্যাপদের কোন কবি নিজেকে বাঙালি বলে পরিচয় দিয়েছেন ?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(95, 9, 'চর্যাপদ হলো -', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(96, 9, 'চর্যাপদ মূলত -', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(97, 9, 'চর্যাপদের আদি কবি কে?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(98, 9, 'চর্যাপদ কোন ছন্দে লেখা?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(99, 9, '\'টালত মোর ঘর নাহি পড়বেশী\' হাড়ীতে ভাত নাহি নিতি আবেশী\' । চর্যাপদের এ চরণ দুটিতে কি বোঝানো হয়েছে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(100, 9, 'চর্যাপদ আবিষ্কার করেন__', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(101, 9, 'বাংলা ভাষার আদি নিদর্শন চর্যাপদ কত সালে, কোথায় আবিষ্কৃত হয়েছিল?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(102, 9, '\'চর্যাপদ\' কোথায় আবিষ্কার হয়?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(103, 9, 'কোন জন \'চর্যাপদ\'-এর পদকর্তা?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(104, 9, 'চর্যাপদ মূলত-', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(105, 9, 'চর্যাপদের গান সংখ্যা কতগুলো?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(106, 9, 'চর্যাপদের আদি কবি কে?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(107, 9, 'কোন কবির সবচেয়ে বেশি চর্যাপদ পাওয়া গেছে ?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(108, 9, 'চর্যাপদের আদি কবি কে ?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(109, 9, '\'চর্যাপদ\' কোন ছন্দে লেখা?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(110, 9, 'চর্যাপদে কোন ধর্মমতের কথা আছে ?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(111, 9, 'চর্যাপদ কোন ছন্দে লেখা ?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(112, 9, 'কোন ব্যক্তি সম্প্রতি নতুন চর্যাপদ আবিষ্কার করেন?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(113, 9, 'কোন জন \'চযাপদে\'র পদকর্তা?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(114, 9, '\'চর্যাপদের \' আদি কবি কে?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(115, 9, 'বাংলা সাহিত্যের প্রাচীন নিদর্শন কোনটি?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(116, 9, 'বাংলা ভাষার প্রাচীন নিদর্শন কোনটি?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(117, 9, 'চর্যাপদে কোন ধর্মের কথা বলা হয়েছে?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(118, 9, 'চর্যাপদ রচনার উদ্দেশ্য কি ছিল?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(119, 9, 'চর্যাপদের টীকাকারের নাম কী?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(120, 9, 'বাংলা ভাষার প্রথম কবিতা সংকলন কোনটি?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(121, 9, 'বাংলা ভাষার আদি নিদর্শন চর্যাপদ আবিষ্কৃত হয় কত সালে?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(122, 9, '‘চর্যাপদ’ কোন ছন্দে রচিত ?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(123, 9, 'বাংলা সাহিত্যের (চর্যাপদের) আদি কবি কে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(124, 9, 'কোনজন চর্যাপদের পদকর্তা?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(125, 9, 'বাংলা সাহিত্যের আদি নিদর্শন চর্যাপদ এর আবিষ্কর্তা হলেন-', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(126, 9, 'ড. মুহম্মদ শহীদুল্লাহ সম্পাদিত চর্যাপদ বিষয়ক গ্রন্থের নাম কী?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(127, 9, 'চর্যাপদের প্রাপ্তিস্থান কোথায়?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(128, 9, 'চর্যাপদ হলো-', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(129, 9, 'চর্যাপদের অধ্যাত্মভাবনা ও সাহিত্যিক উৎকর্ষেরা সর্বোত্তম সমস্বয় ঘটেছে যার মাধ্যমে-', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(130, 9, '’চর্যাপদ’ কোন ছন্দে লেখা?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(131, 9, 'চর্যাপদের ভাষাকে ‘আলো -আঁধারি বলে অভিহিত করেছেন কে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(132, 9, 'চর্যাপদ কে সম্পাদন করেন?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(133, 9, '‘চর্যাপদ’ কোন যুগের কাব্য?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(134, 9, 'চর্যাপদে কত জন কবির পদ রয়েছে?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(135, 9, 'চর্যাপদ কত সালে আবিষ্কৃত হয়?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(136, 9, 'চর্যাপদ’ হলো মূলত-', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(137, 9, '‘চর্যাপদ’ কোথা থেকে আবিষ্কৃত হয়েছে?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(138, 9, '‘চর্যাপদ’ আবিষ্কার করেন-', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(139, 9, 'চর্যাপদ কোন ছন্দে লেখা?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(140, 9, '‘সন্ধ্যাভাষা’ অনুষঙ্গটি কোন সাহি্যেধারা সঙ্গে সংশ্লিষ্ট?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(141, 9, '‘চর্যাপদ’ কত সালে আবিষ্কার হয়?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(142, 9, 'হরপ্রসাদ শাস্ত্রী প্রথম কোথা থেকে চর্যাপদ আবিষ্কার করেন?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(143, 9, '‘চর্যাপদ’ মূলত:', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(144, 9, 'চর্যাপদ কত জনের রচনার সন্ধান পাওয়া যায়?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(145, 9, 'চর্যাপদের ভাষা-', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(146, 9, '’চর্যাপদ’ আবিষ্কৃত হয় কত সালে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(147, 9, 'চর্যাপদের প্রথম পদের রচয়িতা-', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(148, 9, '`চর্যাপদ’ কোন ছন্দে লেখা?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(149, 9, 'চর্যাপদ আবিষ্কৃত হয়-', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(150, 9, 'চর্যাপদের কতটি পদ উদ্ধার করা সম্ভব হয়েছে?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(151, 9, '‘চর্যাপদ’ রচনার উদ্দেশ্য কী ছিল?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(152, 9, 'চর্যাপদ’ কোন ছন্দে লেখা?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(153, 9, 'চর্যাপদে সবচেয়ে বেশি পদ রচনা করেন কে?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(154, 9, '\'চর্যাপদ\' এর আদি পদ রচয়িতা-', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(155, 9, 'চর্যাপদ তিব্বতি ভাষায় কে অনুবাদ করেন?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(156, 9, 'বাংলা সাহিত্যের আদি কবি কে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(157, 9, 'চর্যাপদের ভাষাকে ‘সান্ধ্য ভাষা’ বলেছেন কে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(158, 9, 'বাংলা সহিত্যের আদি নিদর্শন কোনটি?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(159, 9, 'সবচেয়ে বেশি চর্যাপদ পাওয়া যায় গেছে কোন কবির ?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(160, 9, 'চর্যাপদ বাংলা ভাষায় রচিত এটি প্রথম প্রমাণ করেন -', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(161, 9, 'সবচেয়ে বেশি চর্যাপদ রচয়িতা চর্যাকার হলেন:', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(162, 9, 'চর্যাপদের সবচেয়ে বেশি পদ রচনা করেন কে?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(163, 9, 'চর্যাপদ কোথা থেকে আবিষ্কৃত হয়েছে?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(164, 9, 'কোন রাজবংশের আমলে চর্যাপদ রচনা শুরু হয়?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(165, 9, '\'চর্যাপদ\' হচ্ছে--', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(166, 9, 'চর্যাপদের কবি কারা?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(167, 9, 'চর্যাপদের তিব্বতি অনুবাদ প্রকাশ করেন কে?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(168, 9, 'চর্যাপদের কোন পদকর্তা সর্বোচ্চ সংখ্যক পদ রচনা করেছেন?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(169, 9, 'চর্যাপদের কোন পদটি খণ্ডিত আকারে পাওয়া যায়?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(170, 9, 'চর্যাপদ রচনাটি বাংলা সাহিত্যের কোন যুগের কাব্য নিদর্শন?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(171, 9, 'চর্যাপদের কোন পদটি অর্ধাকারে/ অর্ধেক অংশে পাওয়া গেছে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(172, 9, 'চর্যাপদ কি?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(173, 9, 'সবচেয়ে বেশি চর্যাপদ পাওয়া গেছে কোন কবির?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(174, 9, 'চর্যাপদের প্রাপ্তি স্থান কোনটি?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(175, 9, 'বাংলা সাহিত্যের প্রাচীন নিদর্শন কোনটি?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(176, 9, '\'চর্যাপদ\' কত সালে আবিষ্কৃত হয়?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(177, 9, '\'সন্ধ্যাভাষা\' কোন সাহিত্যকর্মের সঙ্গে যুক্ত?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(178, 9, 'কোন রাজবংশের আমলে চর্যাপদ রচনা শুরু হয়?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(179, 9, 'চর্যাপদের প্রবাদ বাক্য কয়টি?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(180, 9, 'কাহ্নপা কয়টি পদ রচনা করেছেন?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(181, 9, '‘চর্যাপদে\'র কোন কবি বাঙালি ছিলেন?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(182, 9, '‘চর্যাপদে\'র মোট পদকর্তা কতজন?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(183, 9, '\'চর্যাপদ\' আবিষ্কৃত হয় কত সালে?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(184, 9, 'চর্যাপদের কবি কারা?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(185, 9, 'বাংলা সাহিত্যের প্রাচীন নিদর্শন কোনটি?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(186, 9, 'চর্যাপদ কোন ছন্দে লেখা?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(187, 9, 'চর্যাপদের টীকাকারের নাম কী?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(188, 9, '\'চর্যাপদ\' কত সালে আবিষ্কৃত হয়?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(189, 9, 'চর্যাপদের ভাষাকে কে বাংলায় প্রতিপন্ন করেছেন?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(190, 9, 'চর্যাপদের ভাষাকে কে বাংলায় প্রতিপন্ন করেছেন?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(191, 9, 'চর্যাপদ আবিষ্কারের সাল-', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(192, 9, 'চর্যাপদের প্রথম পদের রচয়িতা কে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(193, 9, 'চর্যাপদ\' এর প্রাপ্তিস্থান কোথায়?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(194, 9, 'বাংলা সাহিত্যের আদি নিদর্শন কোনটি?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(195, 9, 'বাংলা ভাষার আদি নিদর্শন কোনটি?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(196, 9, 'চর্যাপদ বাংলা ভাষায় রচিত এটি প্রমাণ করেন-', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(197, 9, '\'আপনা মাংসে হরিণা বৈরী\' লাইনটি কোন সাহিত্যের অন্তর্ভুক্ত?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(198, 9, '\'কাআ তরুবর পঞ্চ বি ডাল\'-এখানে \'ডাল\' শব্দটি কোন বিশেষ অর্থে ব্যবহৃত হয়েছে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(199, 9, 'চর্যাপদের কোন কবির পদে বাঙালির কথা উল্লেখ আছে?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(200, 9, 'চর্যাপদ আবিষ্কৃত হয়েছিল কত সালে?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(201, 9, 'চর্যাপদ এর পুঁথি আবিষ্কৃত হয় কত সালে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(202, 9, 'চর্যাপদের কবিরা ছিলেন-', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(203, 9, 'বাংলা সাহিত্যের ইতিহাসে প্রথম নিদর্শন কোনটি?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(204, 9, '\'দুহিল দুধু কি বেন্টে সামায়\' পঙক্তির রচয়িতা কে?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(205, 9, 'ড. মুহাম্মদ শহীদুল্লাহ সম্পাদিত চর্যাপদ বিষয়ক গ্রন্থের নাম কি?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(206, 9, 'চর্যাপদের প্রথম পদটির রচয়িতা-', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(207, 9, 'মধ্যযুগের বাংলা সাহিত্যের আদি নিদর্শন কোনটি?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(208, 9, 'চর্যাপদ আবিষ্কার করেন-', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(209, 9, 'বাংলা ভাষা ও সাহিত্যের আদি নিদর্শন কোনটি?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(210, 9, 'চর্যাপদ কোথা থেকে আবিষ্কার করা হয়েছিল?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(211, 9, 'বৌদ্ধদের কোন সম্প্রদায়ের সাধকগণ চর্যাপদ রচনা করেন?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(212, 9, 'বাংলা সাহিত্যের আদি নিদর্শন কোনটি?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(213, 9, 'চর্যাপদের কবিদের মধ্যে সবচেয়ে বেশি পদ কে রচনা করেন?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(214, 9, 'চর্যাপদের কোন কবি নিজেকে বাঙালি বলে পরিচয় দিয়েছেন?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(215, 9, 'চর্যাপদের প্রথম পদের রচয়িতা কে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(216, 9, 'চর্যাপদের যে পদকর্তা \'কৃষ্ণাচার্য\' নামে পরিচিত ছিলেন-', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(217, 9, '\'চর্যাপদে\' সবচেয়ে বেশি সংখ্যক পদ রয়েছে কোন কবির?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(218, 9, '\'চর্যাপদ\' রচনার উদ্দেশ্য ছিল -', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(219, 9, 'নিম্নের কোন কবিকে প্রাচীন বাংলা সাহিত্যের \'চর্যাপদ\' এর কবি হিসেবে গণ্য করা হয়?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(220, 9, 'নিম্নের কোন কবিকে প্রাচীন বাংলা সাহিত্যের \"চর্যাপদ\" এর কবি হিসেবে গণ্য করা হয়?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(221, 9, 'নিম্নের কোন কবিকে প্রাচীন বাংলা সাহিত্যের \"চর্যাপদ\" এর কবি হিসেবে গণ্য করা হয়?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(222, 9, '\'রূপ লাগি আঁখি ঝুরে, গুণে মন ভোর\'- কার রচনা?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(223, 9, 'চর্যাপদ আবিষ্কৃত হয় কত সালে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(224, 9, '\'আপ চাহন্তে আণ বিণঠা\' চর্যাপদের এই প্রবাদ বাক্যের রচয়িতা কে?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(225, 9, '\'চর্যাপদ\' হলো-', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(226, 9, 'চর্যাপদে কতজন কবির পদ রয়েছে?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(227, 9, 'বাংলা সাহিত্যের প্রাচীন নিদর্শন কোনটি?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(228, 9, 'বাংলা ভাষার কোন সাহিত্যকর্মে সান্ধ্যভাষার প্রয়োগ আছে?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(229, 9, 'চর্যাপদের খন্ডিত পদগুলো তিব্বতি থেকে প্রাচীন বাংলায় রূপান্তর করেন-', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(230, 9, 'চর্যাপদের ভাষাকে \'আলো আঁধারি\' বলে অভিহিত করেন কে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(231, 9, 'চর্যাচর্যবিনিশ্চয় এর অর্থ কি?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(232, 9, 'চর্যাপদের বর্ণনা অনুযায়ী ডোম্বীদের পেশা কি ছিল?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(233, 9, 'চর্যাপদের কোন কবি নিজেকে বাঙালী বলে পরিচয় দিয়েছেন?', NULL, '3', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(234, 9, 'সবচেয়ে বেশি চর্যাপদ পাওয়া গেছে কোন কবির?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(235, 9, 'চর্যাপদ ভাষাকে কে বাংলায় প্রতিপন্ন করেছেন?', NULL, '0', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(236, 9, 'চর্যাপদের সর্বাধিক পদ রচয়িতা কে?', NULL, '2', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(237, 9, 'বাংলা সাহিত্যের প্রথম নিদর্শন চর্যাপদের সংখ্যা-', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(238, 9, '\'চর্যাপদ\' যে বাংলা ভাষায় রচিত এটি প্রথম কে প্রমাণ করেন?', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(239, 9, 'প্রাচীন যুগের প্রধান নিদর্শন -', NULL, '1', NULL, '2026-03-05 08:54:06', '2026-03-05 08:54:06'),
(240, 7, '\"শ্রীকৃষ্ণকীর্তন\" কাব্য কে রচনা করেন?', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(241, 7, '\'শ্রীকৃষ্ণকীর্তন\' কাব্যের রচয়িতা-', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(242, 7, 'শ্রীকৃষ্ণকীর্তন কাব্যের বড়াই কি ধরনের চরিত্র?', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(243, 7, '\' শ্রীকৃষ্ণকীর্তন\'---- এর রচয়িতা কে?', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(244, 7, 'শ্রীকৃষ্ণকীর্তন কাব্যের আবিষ্কর্তা-', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(245, 7, 'মধ্যযুগের প্রথম কাব্য “শ্রীকৃষ্ণকীর্তন”-এর রচিয়তা কে?', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(246, 7, '”শ্রীকৃষ্ণকীর্তন” আবিষ্কার করেন কে?', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(247, 7, '”শ্রীকৃষ্ণকীর্তন” আবিষ্কার করেন-', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(248, 7, '”শ্রীকৃষ্ণকীর্তন” কাব্য রচনা করেন-', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(249, 7, '\'শ্রীকৃষ্ণকীর্তন\' কাব্যটি রচনা করেন-', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(250, 7, '”শ্রীকৃষ্ণকীর্তন কাব্য”--- খানি আবিষ্কৃত হয় কোথায়?', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(251, 7, '\'শ্রীকৃষ্ণকীর্তন\' কাব্যটি কে আবিষ্কার করেন?', NULL, '0', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(252, 7, 'গঠনরীতিতে “শ্রীকৃষ্ণকীর্তন” কাব্য মূলত---', NULL, '3', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(253, 7, '‌\'শ্রীকৃষ্ণকীর্তন\' কাব্যের রচয়িতা -', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(254, 7, 'মধ্যযুগের প্রথম কাব্য\'শ্রীকৃষ্ণকীর্তন\' এর রচয়িতা কে?', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(255, 7, '”শ্রীকৃষ্ণ কীর্তন” কাব্য কয় খন্ডের?', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(256, 7, '\'শ্রীকৃষ্ণকীর্তন\' কাব্যের খণ্ড সংখ্যা -', NULL, '3', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(257, 7, '’শ্রীকৃষ্ণকীর্তন কাব্য’ কে রচনা করেন?', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(258, 7, '’শ্রীকৃষ্ণকীর্তন’ শীর্ষক কাব্যগ্রন্থ কে আবিষ্কার করেন?', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(259, 7, 'শ্রীকান্ত উপন্যাস এর রচয়িতা কে?', NULL, '3', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(260, 7, '\'শ্রীকৃষ্ণকীর্তনকাব্য\' এর রচয়িতা কে?', NULL, '0', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(261, 7, '\'শ্রীকৃষ্ণকীর্তন\' কোন যুগের বাংলা সাহিত্যের নিদর্শন?', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(262, 7, '\'শ্রীকৃষ্ণকীর্তন\' কাব্যটি আবিষ্কৃত হয়_', NULL, '0', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(263, 7, '‘শ্রীকৃষ্ণকীর্তন’ কাব্যের রচয়িতা', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(264, 7, 'গঠনরীতিতে ‘শ্রীকৃষ্ণকীর্তন’ কাব্য মূলত-', NULL, '3', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(265, 7, 'শ্রীকৃষ্নকীর্তন কাব্যের সম্পাদক-', NULL, '0', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(266, 7, '‘শ্রীকৃষ্ণকীর্তন’ কাব্যের রচয়িতা-', NULL, '0', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(267, 7, '‘শ্রীকৃষ্ণকীর্তন কাব্য’ কোথা থেকে উদ্ধার করা হয়েছিল?', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(268, 7, '‘শ্রীকৃষ্ণকীর্তন’ এর রচয়িতা কে?', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(269, 7, 'কোনটি ‘শ্রীকৃ্ষ্ণকীর্তন’ কাব্যের অন্তর্ভুক্ত নয়?', NULL, '2', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(270, 7, '\"কৃষ্ণকীর্তন কাব্য\" কোথা থেকে উদ্ধার করা হয়েছিল ?', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(271, 7, 'নিচের কোনটি নাট্যগুণসম্পন্ন আখ্যান কাব্য?', NULL, '3', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(272, 7, 'বাংলা সাহিত্যের ইতিহাসে কাঁকিল্যা গ্রাম কেন উল্লেখযোগ্য?', NULL, '3', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(273, 7, '\'শ্রীকৃষ্ণকীর্তন\' কাব্যের প্রথম খন্ডের নাম কী?', NULL, '0', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(274, 7, '\'শ্রীকৃষ্ণকীর্তন\' কাব্যের প্রথম খন্ডের নাম কী?', NULL, '0', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(275, 7, 'মধ্যযুগের কোন কাব্যকে \'নাট-গীত-পাঞ্চালী\' বলা হয়?', NULL, '1', NULL, '2026-03-05 08:56:49', '2026-03-05 08:56:49'),
(276, 6, 'শৃঙ্গার রসকে বৈষ্ণব পদাবলিতে কী রস বলে?', NULL, '1', NULL, '2026-03-05 08:59:47', '2026-03-05 08:59:47'),
(277, 6, '”সই কেবা শুনাইল শ্যামনাম” পদটি কোন বৈষ্ণব কবির রচনা?', NULL, '2', NULL, '2026-03-05 08:59:47', '2026-03-05 08:59:47'),
(278, 6, 'বাংলা ভাষায় বৈষ্ণব পদাবলীর আদি রচয়িতা কে?', NULL, '0', NULL, '2026-03-05 08:59:47', '2026-03-05 08:59:47'),
(279, 6, '”বৈষ্ণব পদাবলী” তে রস কত প্রকার?', NULL, '0', NULL, '2026-03-05 08:59:47', '2026-03-05 08:59:47'),
(280, 6, 'বৈষ্ণব পদাবলীর অবাঙালি কবি কে?', NULL, '3', NULL, '2026-03-05 08:59:47', '2026-03-05 08:59:47'),
(281, 6, 'বৈষ্ণব পদকর্তা “চন্ডীদাস” কত জন?', NULL, '0', NULL, '2026-03-05 08:59:47', '2026-03-05 08:59:47'),
(282, 6, 'বৈষ্ণব পদাবলির আদি রচয়িতা কে?', NULL, '1', NULL, '2026-03-05 08:59:47', '2026-03-05 08:59:47'),
(283, 6, 'বৈষ্ণব পদাবলীর সঙ্গে কোন ভাষা সম্পর্কিত?', NULL, '2', NULL, '2026-03-05 08:59:47', '2026-03-05 08:59:47'),
(284, 6, '“ সুখের লাগিয়া এ ঘর বাঁধিনু, অনলে পুড়িয়া গেল” এই বৈষ্ণবপদের রচিয়তা কে?', NULL, '0', NULL, '2026-03-05 08:59:47', '2026-03-05 08:59:47'),
(285, 6, 'শৃঙ্গার রসকে বৈষ্ণব পদাবলিতে কি রস বলে?', NULL, '3', NULL, '2026-03-05 08:59:47', '2026-03-05 08:59:47'),
(286, 13, 'মঙ্গলকাব্যের কবি নন কে?', NULL, '3', NULL, '2026-03-05 09:01:53', '2026-03-05 09:01:53'),
(287, 13, 'মঙ্গলকাব্যে কোন দুই দেবতার প্রাধান্য বেশি?', NULL, '3', NULL, '2026-03-05 09:01:53', '2026-03-05 09:01:53'),
(288, 13, 'মঙ্গলকাব্য রচনার মূলে উল্লিখিত কারণ কি?', NULL, '1', NULL, '2026-03-05 09:01:53', '2026-03-05 09:01:53'),
(289, 13, '\'মঙ্গলকাব্যে\'র রচয়িতা নন-', NULL, '1', NULL, '2026-03-05 09:01:53', '2026-03-05 09:01:53'),
(290, 13, 'কোন দেবীর কাহিনী নিয়ে মঙ্গলকাব্য রচিত?', NULL, '2', NULL, '2026-03-05 09:01:53', '2026-03-05 09:01:53'),
(291, 13, 'চাঁদ সওদাগর কোন মঙ্গলকাব্যের নায়ক?', NULL, '3', NULL, '2026-03-05 09:01:53', '2026-03-05 09:01:53'),
(292, 13, 'মঙ্গলকাব্যের কোন চরিত্রটি “দেবতা-বিরোধী” বলে পরিচিত?', NULL, '3', NULL, '2026-03-05 09:01:53', '2026-03-05 09:01:53'),
(293, 13, '’বেহুলা’ চরিত্রটি কোন মঙ্গলকাব্যের সম্পদ?', NULL, '3', NULL, '2026-03-05 09:01:54', '2026-03-05 09:01:54'),
(294, 13, '\'বেগুলা - লখিন্দরের\' কাহিনী পাওয়া যায় কোন মঙ্গলকাব্যে?', NULL, '0', NULL, '2026-03-05 09:01:54', '2026-03-05 09:01:54'),
(295, 13, '\'ভাঁড়ুদত্ত\' চরিত্রটি পাওয়া যায় কোন গ্রন্থে?', NULL, '2', NULL, '2026-03-05 09:01:54', '2026-03-05 09:01:54'),
(296, 13, '\'মঙ্গলকাব্য\' -এ ধর্মীয় আরাধনা মূখ্য হলে ও এর অন্যতম সাধারণ বৈশিষ্ট্য হলো -', NULL, '1', NULL, '2026-03-05 09:01:54', '2026-03-05 09:01:54'),
(297, 13, '\'আমার সন্তান যেন থাকে দুধে ভাতে\' - কার প্রার্থনা?', NULL, '2', NULL, '2026-03-05 09:01:54', '2026-03-05 09:01:54'),
(298, 13, '‘ফুল্লাবার বারমাস্যা’ কোন মঙ্গলকাব্যের অন্তগর্ত?', NULL, '1', NULL, '2026-03-05 09:01:54', '2026-03-05 09:01:54'),
(299, 13, 'মঙ্গলকাব্যের শেষ কবি -', NULL, '2', NULL, '2026-03-05 09:01:54', '2026-03-05 09:01:54'),
(300, 13, '‘ভাড়ুদত্ত’কোন কাব্যের চরিত্র?', NULL, '0', NULL, '2026-03-05 09:01:54', '2026-03-05 09:01:54'),
(301, 14, '\'অসমাপ্ত আত্মজীবনী\' একটি -', NULL, '2', NULL, '2026-03-05 09:03:26', '2026-03-05 09:03:26'),
(302, 14, 'জীবনী সাহিত্যের ধারা গড়ে ওঠে কাকে কেন্দ্র করে?', NULL, '0', NULL, '2026-03-05 09:03:26', '2026-03-05 09:03:26'),
(303, 14, 'নিচের কোনটি জীবনী সাহিত্য?', NULL, '3', NULL, '2026-03-05 09:03:26', '2026-03-05 09:03:26'),
(304, 14, 'শামসুর রাহমানের আত্মজীবনী কোনটি?', NULL, '1', NULL, '2026-03-05 09:03:26', '2026-03-05 09:03:26'),
(305, 14, 'শ্রীচৈতন্যদেবের জীবনভিত্তিক প্রথম কাহিনী কাব্য কে রচনা করেন?', NULL, '0', NULL, '2026-03-05 09:03:26', '2026-03-05 09:03:26'),
(306, 14, 'চৈতন্য জীবনী কাব্যের শ্রেষ্ঠ কবি কে?', NULL, '0', NULL, '2026-03-05 09:03:26', '2026-03-05 09:03:26'),
(307, 15, 'বাংলায় কোরআন শরীফের প্রথম অনুবাদক কে?', NULL, '1', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(308, 15, '\' ইউসুফ-জোলেখা\' প্রণয়কাব্য অনুবাদ করেছেন -----', NULL, '3', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(309, 15, 'সংস্কৃত রামায়ণ বাংলায় অনুবাদ করেন-', NULL, '3', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(310, 15, 'বাংলায় প্রথম পবিত্র কোরনের অনুবাদক-', NULL, '3', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(311, 15, 'বাংলা সাহিত্যের কোন যুগে কবিরা অনুবাদ সাহিত্যে হাত দেন?', NULL, '1', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(312, 15, 'বাংলা সাহিত্যের কোন যুগে কবিরা অনুবাদ সাহিত্যে হাত দেন?', NULL, '1', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(313, 15, 'ইংরেজি ভাষায় জীবনানন্দ দাশের ওপর গ্রন্থ লিখেছেন কে?', NULL, '1', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(314, 15, 'মুনীর চৌধুরীর ৎমখরা রমনী বশীকরণ’ একটি-', NULL, '3', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(315, 15, 'চর্যাপদ তিব্বতি ভাষায় কে অনুবাদ করেন?', NULL, '2', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(316, 15, 'গ্রিক ট্রাজেডি \'ইডিপাস\' বাংলায় কে অনুবাদ করেন?', NULL, '2', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(317, 15, 'আবু ইসহাকের \'সূর্য দীঘল বাড়ি\' কোন কবি অনুবাদ করেন?', NULL, '0', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(318, 15, 'বাংলায় মহাভারত অনুবাদ করেছেন—', NULL, '0', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(319, 15, 'ঈশ্বরচন্দ্র বিদ্যাসাগরের ‘ভ্রান্তিবিলাস’ ইংরেজি কোন গ্রন্থের গদ্য-অনুবাদ ?', NULL, '1', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(320, 15, '\'পরাগলী মহাভারত\' খ্যাত গ্রন্থের অনুবাদকের নাম কী?', NULL, '1', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(321, 15, '\'অসমাপ্ত আত্মজীবনী\' গ্রন্থের ইংরেজী অনুবাদক কে?', NULL, '3', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(322, 15, 'শকুন্তলা\'র অনুবাদক-', NULL, '1', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(323, 15, 'মুনীর চৌধুরীর \'মুখরা রমণী বশীকরণ\' একটি-', NULL, '3', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(324, 15, 'অনুবাদ কত প্রকার?', NULL, '0', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(325, 15, '\'ইউসুফ-জোলেখা\' কাব্যের অনুবাদক-', NULL, '3', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(326, 15, 'বাংলায় টিএস এলিয়টের কবিতার প্রথম অনুবাদ-', NULL, '0', NULL, '2026-03-05 09:05:19', '2026-03-05 09:05:19'),
(327, 16, 'সপ্তদশ শতকের কবি আলাওলের প্রধান কাব্য কোনটি?', NULL, '0', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(328, 16, '\'ইউসুফ জোলেখা\' কী জাতীয় রচনা?', NULL, '2', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(329, 16, '‘ইউসুফ-জুলেখা’ কী জাতীয় রচনা?', NULL, '2', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(330, 16, '‘ইউসুফ জোলেখা’ কী জাতীয় রচনা?', NULL, '2', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(331, 16, 'রোসাঙ্গ-রাজসভার পৃষ্ঠপোষকতায় রচিত হয়েছে—', NULL, '0', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(332, 16, '\'পদ্মাবতী\' কাব্যের লেখক কে?', NULL, '2', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(333, 16, 'মধ্যযুগের কাব্য কোনটি?', NULL, '1', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(334, 16, 'আলাওলের প্রথম কাব্যগ্রন্থ কোনটি?', NULL, '0', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(335, 16, '\'ইউসুফ জুলেখা\' কাব্য লেখক কে ?', NULL, '1', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(336, 16, '\'ইউসুফ-জোলেখা\' কাব্য কার শাসন আমলে রচিত হয়?', NULL, '0', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(337, 16, 'কোন্ কাব্যে আলাওল ব্যক্তিগত জীবনের কথা লিখেছেন?', NULL, '0', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(338, 16, '‘ইউসুফ-জুলেখা’ কী জাতীয় রচনা?', NULL, '1', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(339, 16, '\'ইউসুফ-জুলেখা\' কাব্যের উৎস হচ্ছে-', NULL, '0', NULL, '2026-03-05 09:10:24', '2026-03-05 09:10:24'),
(340, 19, '\'মর্সিয়া\' কি?', NULL, '1', NULL, '2026-03-05 09:12:16', '2026-03-05 09:12:16'),
(341, 19, 'মর্সিয়া কি?', NULL, '2', NULL, '2026-03-05 09:12:16', '2026-03-05 09:12:16'),
(342, 19, '”মর্সিয়া” শব্দের উৎস ভাষা--', NULL, '0', NULL, '2026-03-05 09:12:16', '2026-03-05 09:12:16'),
(343, 19, 'মর্সিয়া সাহিত্যের বিষয়বস্তু-', NULL, '0', NULL, '2026-03-05 09:12:16', '2026-03-05 09:12:16'),
(344, 19, '\'ইউসুফ জুলেখা\' মর্সিয়া সাহিত্যের লেখক কে?', NULL, '2', NULL, '2026-03-05 09:12:16', '2026-03-05 09:12:16'),
(345, 19, '’মর্সিয়া’ শ্বদটি কোন ভাষা থেকে এসেছে?', NULL, '3', NULL, '2026-03-05 09:12:16', '2026-03-05 09:12:16'),
(346, 19, 'কোনটি মর্সিয়া সাহিত্য?', NULL, '3', NULL, '2026-03-05 09:12:16', '2026-03-05 09:12:16'),
(347, 21, '<p>1.&#39; Needle: Thread&quot; Find out the correct analogy</p>', NULL, '1', NULL, '2026-03-07 07:53:12', '2026-03-07 07:53:12');

-- --------------------------------------------------------

--
-- Table structure for table `question_categories`
--

CREATE TABLE `question_categories` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `parent_category_id` bigint(20) UNSIGNED DEFAULT NULL,
  `name` varchar(150) NOT NULL,
  `slug` varchar(160) NOT NULL,
  `description` text DEFAULT NULL,
  `status` tinyint(1) DEFAULT 1,
  `created_by` bigint(20) UNSIGNED DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `question_categories`
--

INSERT INTO `question_categories` (`id`, `parent_category_id`, `name`, `slug`, `description`, `status`, `created_by`, `created_at`, `updated_at`) VALUES
(1, 2, 'বাংলা সাহিত্যের আদিযুগ', 'bangla-sahitzer-adizug', NULL, 1, 1, '2026-02-17 18:59:55', '2026-03-04 17:45:11'),
(2, 3, 'বাংলা সাহিত্যের যুগসমূহ', 'bangla-sahitzer-zugsmuuh', NULL, 1, 1, '2026-02-17 19:00:43', '2026-03-04 17:44:35'),
(3, NULL, 'বাংলা', 'bangla', NULL, 1, 1, '2026-02-18 02:11:53', '2026-03-04 17:43:37'),
(5, NULL, 'English', 'english', NULL, 1, 1, '2026-02-18 03:00:39', '2026-02-18 03:00:39'),
(6, 8, 'বৈষ্ণব পদাবলি', 'boishnb-pdabli', NULL, 1, 1, '2026-02-18 03:01:01', '2026-03-04 17:50:00'),
(7, 8, 'শ্রীকৃষ্ণকীর্তন', 'sreekrrishnkeertn', NULL, 1, 1, '2026-02-18 03:01:17', '2026-03-04 17:49:27'),
(8, 2, 'বাংলা সাহিত্যের মধ্যযুগ', 'bangla-sahitzer-mdhzzug', NULL, 1, 1, '2026-02-18 03:06:02', '2026-03-04 17:48:36'),
(9, 1, 'চর্যাপদ', 'crzapd', NULL, 1, 1, '2026-02-20 17:49:21', '2026-03-04 17:47:57'),
(10, 1, 'বাংলা জাতির উদ্ভব', 'bangla-jatir-udvb', NULL, 1, 1, '2026-02-22 05:24:57', '2026-03-04 17:45:52'),
(11, 1, 'বাংলা ভাষার উদ্ভব', 'bangla-vashar-udvb', NULL, 1, 1, '2026-03-04 17:46:42', '2026-03-04 17:47:22'),
(13, 8, 'মঙ্গলকাব্য', 'mngolkabz', NULL, 1, 1, '2026-03-04 17:51:45', '2026-03-04 17:51:45'),
(14, 8, 'জীবনী সাহিত্য', 'jeebnee-sahitz', NULL, 1, 1, '2026-03-04 18:12:10', '2026-03-04 18:12:10'),
(15, 8, 'অনুবাদ সাহিত্য', 'onubad-sahitz', NULL, 1, 1, '2026-03-04 18:14:47', '2026-03-04 18:14:47'),
(16, 8, 'রোমান্টিক প্রণয়োপাখ্যান', 'romantik-prnyopakhzan', NULL, 1, 1, '2026-03-04 18:23:33', '2026-03-04 18:23:33'),
(18, 1, 'বাংলা-লিপির-উদ্ভব', 'bangla-lipir-udvb', NULL, 1, 1, '2026-03-05 08:51:17', '2026-03-05 08:51:17'),
(19, 8, 'মর্সিয়া-সাহিত্য', 'mrsiya-sahitz', NULL, 1, 1, '2026-03-05 09:12:06', '2026-03-05 09:15:11'),
(20, 5, 'English Grammar', 'english-grammar', NULL, 1, 1, '2026-03-07 07:51:32', '2026-03-07 07:51:32'),
(21, 20, 'Analogy', 'analogy', NULL, 1, 1, '2026-03-07 07:51:54', '2026-03-07 07:51:54');

-- --------------------------------------------------------

--
-- Table structure for table `question_options`
--

CREATE TABLE `question_options` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `question_id` bigint(20) UNSIGNED NOT NULL,
  `option_text` varchar(255) NOT NULL,
  `is_correct` tinyint(1) DEFAULT 0
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `question_options`
--

INSERT INTO `question_options` (`id`, `question_id`, `option_text`, `is_correct`) VALUES
(1, 1, 'সংস্কৃত', 0),
(2, 1, 'পালি', 0),
(3, 1, 'প্রাকৃত', 1),
(4, 1, 'অপ্রভ্রংশ', 0),
(5, 2, 'সংস্কৃত', 0),
(6, 2, 'পালি', 0),
(7, 2, 'প্রাকৃত', 1),
(8, 2, 'অপভ্রংশ', 0),
(9, 3, 'পালি', 0),
(10, 3, 'সংস্কৃত', 0),
(11, 3, 'প্রাকৃত', 1),
(12, 3, 'হিন্দি', 0),
(13, 4, 'প্রাকৃত', 1),
(14, 4, 'আদিত্য', 0),
(15, 4, 'পালি', 0),
(16, 4, 'অপভ্রংশ', 0),
(17, 4, 'ফারসি', 0),
(18, 5, 'সংস্কৃত থেকে', 0),
(19, 5, 'গৌড়ীয় প্রাকৃত থেকে', 1),
(20, 5, 'মাগধী প্রাকৃত থেকে', 0),
(21, 5, 'মৈথিলী থেকে', 0),
(22, 6, 'সপ্তম খ্রিষ্টাব্দে', 1),
(23, 6, 'অষ্টম খ্রিষ্টাব্দে', 0),
(24, 6, 'খ্রিষ্টিয় ত্রয়োদশ শতকে', 0),
(25, 6, 'খ্রিষ্টয় দ্বাদশ শতকে', 0),
(26, 7, 'সংস্কৃত', 0),
(27, 7, 'প্রাকৃত', 0),
(28, 7, 'পালি', 0),
(29, 7, 'গৌড় অপভ্রংশ', 1),
(30, 8, 'সংস্কৃত', 0),
(31, 8, 'পালি', 0),
(32, 8, 'প্রাকৃত', 1),
(33, 8, 'অপভ্রংশ', 0),
(34, 9, 'সংস্কৃত', 0),
(35, 9, 'পালি', 0),
(36, 9, 'প্রাকৃত', 1),
(37, 9, 'অপভ্রংশ', 0),
(38, 10, 'সংস্কৃত', 0),
(39, 10, 'প্রাকৃত', 1),
(40, 10, 'হিন্দি', 0),
(41, 10, 'পালি', 0),
(42, 11, 'প্রাকৃত', 1),
(43, 11, 'পালি', 0),
(44, 11, 'সংস্কৃত', 0),
(45, 11, 'অপভ্রংশ', 0),
(46, 12, 'সংস্কৃত', 0),
(47, 12, 'প্রাকৃত', 1),
(48, 12, 'অপভ্রংশ', 0),
(49, 12, 'পালি', 0),
(50, 13, '২', 1),
(51, 13, '৪', 0),
(52, 13, '৩', 0),
(53, 13, '৫', 0),
(54, 14, '২০০০', 0),
(55, 14, '১০০০', 1),
(56, 14, '৪০০০', 0),
(57, 14, '৩০০০', 0),
(58, 15, 'ড. মুহম্মদ শহীদুল্লাহ', 0),
(59, 15, 'জর্জ আব্রাহাম গ্রিয়ার্সন', 0),
(60, 15, 'ড. মুহম্মদ এনামুল', 0),
(61, 15, 'ডক্টর সুনীতিকুমার চট্টোপাধ্যায়', 1),
(62, 16, 'মাগধী', 0),
(63, 16, 'গৌড়ীয়', 0),
(64, 16, 'গৌড়ীয় প্রাকৃত', 0),
(65, 16, 'বজ্রবুলি', 1),
(66, 17, 'বজ্রবুলি', 0),
(67, 17, 'সংস্কৃত', 0),
(68, 17, 'অপভ্রংশ', 1),
(69, 17, 'পালি', 0),
(70, 18, 'শতম', 1),
(71, 18, 'কেন্তুম', 0),
(72, 18, 'সংস্কৃত', 0),
(73, 18, 'কোনটি নয়', 0),
(74, 19, 'সপ্তম শতাব্দী', 1),
(75, 19, 'অষ্টম শতাব্দী', 0),
(76, 19, 'দশম শতাব্দী', 0),
(77, 19, 'কোনটি নয়', 0),
(78, 20, 'গৌড়ীয়', 0),
(79, 20, 'মাগধী প্রাকৃত', 1),
(80, 20, 'গৌড়ীয় প্রাকৃত', 0),
(81, 20, 'পালি', 0),
(82, 21, 'নাগরী লিপি', 0),
(83, 21, 'শ্যামী লিপি', 0),
(84, 21, 'সিংহলী লিপি', 0),
(85, 21, 'ব্রাক্ষী লিপি', 1),
(86, 22, 'সংস্কৃত লিপি', 0),
(87, 22, 'চীনা লিপি', 0),
(88, 22, 'আরবি লিপি', 0),
(89, 22, 'ব্রাহ্মী লিপি', 1),
(90, 23, 'খরোষ্ঠী লিপি', 0),
(91, 23, 'ব্রাক্ষী লিপি', 1),
(92, 23, 'অশোক লিপি', 0),
(93, 23, 'প্রকৃত লিপি', 0),
(94, 24, 'সংস্কৃত লিপি', 0),
(95, 24, 'ব্রাক্ষী লিপি', 1),
(96, 24, 'চীনা লিপি', 0),
(97, 24, 'আরবী লিপি', 0),
(98, 25, 'সংস্কৃত লিপি', 0),
(99, 25, 'চীনা লিপি', 0),
(100, 25, 'আরবি লিপি', 0),
(101, 25, 'ব্রাহ্মী লিপি', 1),
(102, 26, 'সংস্কৃত লিপি', 0),
(103, 26, 'চীনা লিপি', 0),
(104, 26, 'আরবী লিপি', 0),
(105, 26, 'ব্রাহ্মী লিপি', 1),
(106, 27, 'তৎসম লিপি', 0),
(107, 27, 'সংস্কৃত লিপি', 0),
(108, 27, 'ব্রাক্ষী লিপি', 1),
(109, 27, 'আগ্নেয় লিপি', 0),
(110, 28, 'সংস্কৃত', 0),
(111, 28, 'চীনা লিপি', 0),
(112, 28, 'আরবি লিপি', 0),
(113, 28, 'ব্রাহ্মী লিপি', 1),
(114, 29, 'ব্ৰহ্মী লিপি', 0),
(115, 29, 'পূর্বী লিপি', 1),
(116, 29, 'পশ্চিমা লিপি', 0),
(117, 29, 'মধ্যভারতীয় লিপি', 0),
(118, 30, 'সংস্কৃত লিপি', 0),
(119, 30, 'আরবি লিপি', 0),
(120, 30, 'চিনা লিপি', 0),
(121, 30, 'ব্রাহ্মী লিপি', 1),
(122, 31, 'অশোক', 1),
(123, 31, 'চন্দ্রগুপ্ত', 0),
(124, 31, 'কণিঙ্ক', 0),
(125, 31, 'মহীপাল', 0),
(126, 32, 'গুপ্ত লিপি', 0),
(127, 32, 'দেবনাগরী লিপি', 0),
(128, 32, 'নাগরী লিপি', 0),
(129, 32, 'ব্রাহ্মী লিপি', 1),
(130, 33, 'খরোষ্ঠী লিপি', 0),
(131, 33, 'কুটিল লিপি', 1),
(132, 33, 'নাগরী লিপি', 0),
(133, 33, 'গুপ্ত লিপি', 0),
(134, 34, 'পাল আমল', 0),
(135, 34, 'গুপ্ত আমল', 1),
(136, 34, 'সেন আমল', 0),
(137, 34, 'মুঘল আমল', 0),
(138, 34, 'কোনটিই নয়', 0),
(139, 35, 'তিব্বত', 0),
(140, 35, 'বাংলাদেশ', 0),
(141, 35, 'নেপাল', 1),
(142, 35, 'ভারত', 0),
(143, 36, 'সনাতন হিন্দু', 0),
(144, 36, 'সহজিয়া বৌদ্ধ', 1),
(145, 36, 'জৈন', 0),
(146, 36, 'হরিজ', 0),
(147, 37, 'বেদ', 0),
(148, 37, 'শূন্যপূরাণ', 0),
(149, 37, 'মঙ্গলকাব্য', 0),
(150, 37, 'চর্যাপদ', 1),
(151, 38, 'পাল', 1),
(152, 38, 'সেন', 0),
(153, 38, 'মুঘল', 0),
(154, 38, 'তুর্কী', 0),
(155, 39, 'বঙ্গীয় সাহিত্য পরিষদ', 1),
(156, 39, 'শ্রীরামপুর মিশন', 0),
(157, 39, 'এশিয়াটিক সোসাইটি', 0),
(158, 39, 'ফোর্ট উইলিয়াম কলেজ', 0),
(159, 40, 'ডক্টর মুহাম্মদ শহীদুল্লাহ', 0),
(160, 40, 'ডক্টর সুনীতিকুমার চট্টোপাধ্যায়', 0),
(161, 40, 'হরপ্রসাদ শাস্ত্রী', 1),
(162, 40, 'ডক্টর সুকুমার সেন', 0),
(163, 41, 'নেপালের ধর্মশালা থেকে', 0),
(164, 41, 'বাকুড়ার এক গোয়াল ঘর থেকে', 0),
(165, 41, 'তিব্বতের ধর্মশালা থেকে', 0),
(166, 41, 'নেপালের রাজ গ্রন্থশালা', 1),
(167, 42, 'লুইপা', 0),
(168, 42, 'কুক্করীপা', 0),
(169, 42, 'সরহপা', 0),
(170, 42, 'কাহ্নপা', 1),
(171, 43, 'পথের পাচালী', 0),
(172, 43, 'বৈষ্ণব পদাবলী', 0),
(173, 43, 'চর্যাপদ', 1),
(174, 43, 'কোনোটিই নয়', 0),
(175, 44, 'বাঁকুড়ার এক গৃহস্থের গোয়াল ঘর থেকে', 0),
(176, 44, 'আরাকান রাজগ্রন্থাগার থেকে', 0),
(177, 44, 'নেপালের রাজগ্রন্থশালা থেকে', 1),
(178, 44, 'সুদূর চীন দেশ থেকে', 0),
(179, 45, '২০০৭', 0),
(180, 45, '১৯০৭', 1),
(181, 45, '১৯০৯', 0),
(182, 45, '১৯১৬', 0),
(183, 46, 'অক্ষরবৃত্ত', 0),
(184, 46, 'মাত্রাবৃত্ত', 1),
(185, 46, 'স্বরবৃত্ত', 0),
(186, 46, 'অমিত্রাক্ষর ছন্দ', 0),
(187, 47, '১৮০০', 0),
(188, 47, '১৮৫৭', 0),
(189, 47, '১৯০৭', 1),
(190, 47, '১৯০৯', 0),
(191, 48, 'লুইপা', 0),
(192, 48, 'শবরপা', 0),
(193, 48, 'ভুসুকুপা', 0),
(194, 48, 'কাহ্নপা', 1),
(195, 49, '২৭ জন', 0),
(196, 49, '২৬ জন', 0),
(197, 49, '২৪ জন', 1),
(198, 49, '২৫ জন', 0),
(199, 50, 'লুইপা', 0),
(200, 50, 'শবরপা', 0),
(201, 50, 'কাহ্নপা', 1),
(202, 50, 'ভসুকুপা', 0),
(203, 51, 'ব্রজবুলি', 0),
(204, 51, 'জগাখিচুড়ি', 0),
(205, 51, 'সন্ধ্যাভাষা', 0),
(206, 51, 'বঙ্গ-কামরূপী', 1),
(207, 52, 'Buddhist Mystic Songs', 1),
(208, 52, 'চর্যাগীতিকা', 0),
(209, 52, 'চর্যাগীতিকোষ', 0),
(210, 52, 'হাজার বছরের পুরাণ বাংলা ভাষায় বৌদ্ধগান ও দোহা', 0),
(211, 53, '১০ নং পদ', 0),
(212, 53, '১৬ নং পদ', 0),
(213, 53, '১৮ নং পদ', 0),
(214, 53, '২৩ নং পদ', 1),
(215, 54, 'শূন্যপুরাণ', 0),
(216, 54, 'নিরঞ্জনের রুম্মা', 0),
(217, 54, 'সেক শুভদয়া', 0),
(218, 54, 'চর্যাপদ', 1),
(219, 55, 'কলিকাতায়', 0),
(220, 55, 'ঢাকায়', 0),
(221, 55, 'ভুটানে', 0),
(222, 55, 'নেপালে', 1),
(223, 56, 'চীন', 0),
(224, 56, 'নেপাল', 1),
(225, 56, 'মায়ানমার', 0),
(226, 56, 'ভারত', 0),
(227, 57, 'ছড়া', 0),
(228, 57, 'গল্প', 0),
(229, 57, 'গান', 1),
(230, 57, 'রম্য রচনা', 0),
(231, 58, 'সনাতন হিন্দু', 0),
(232, 58, 'জৈন ধর্ম', 0),
(233, 58, 'সহজিয়া বোদ্ধ', 1),
(234, 58, 'হরিজন', 0),
(235, 59, 'বঙ্গীয় সাহিত্য পরিষদ', 1),
(236, 59, 'এশিয়াটিক সোসাইটি', 0),
(237, 59, 'শ্রীরামপুর মিশন', 0),
(238, 59, 'ফোর্ট উইলিয়াম কলেজ', 0),
(239, 60, 'ড. মুহম্মদ শহীদুল্লাহ', 0),
(240, 60, 'শ্রী হরপ্রসাদ শাস্ত্রী', 1),
(241, 60, 'ড. দীনেশচন্দ্র', 0),
(242, 60, 'শ্রী হরলাল রায়', 0),
(243, 61, '১৯০৭ সালে', 1),
(244, 61, '১৯১৬ সালে', 0),
(245, 61, '১৯২১ সালে', 0),
(246, 61, '১৯২৩ সালে', 0),
(247, 62, 'কাহ্ন পা', 0),
(248, 62, 'লুই পা', 0),
(249, 62, 'ডাকার্ণব', 0),
(250, 62, 'মুনিদত্ত', 1),
(251, 62, 'কোনটিই নয়', 0),
(252, 63, 'হরপ্রসাদ শাস্ত্রী', 0),
(253, 63, 'সুকুমার সেন', 0),
(254, 63, 'মুহম্মদ শহীদুল্লাহ', 0),
(255, 63, 'ড. সুনীতিকুমার চট্টোপাধ্যায়', 1),
(256, 64, '১৯১৬ খ্রি.', 0),
(257, 64, '১৯১৯খ্রি.', 0),
(258, 64, '১৯০৭ খ্রি.', 1),
(259, 64, '১৯১৭ খ্রি.', 0),
(260, 65, 'কাহ্নপা', 1),
(261, 65, 'কুক্করীপা', 0),
(262, 65, 'লুপাই', 0),
(263, 65, 'ভুসুকুপা', 0),
(264, 66, '১৯১০', 0),
(265, 66, '১৯১২', 0),
(266, 66, '১৯০৮', 0),
(267, 66, '১৯০৭', 1),
(268, 67, 'ড. মুহাম্মদ শহীদুল্লাহ', 0),
(269, 67, 'মহামহোপাধ্যায় হরপ্রসাদ শাস্ত্রী', 1),
(270, 67, 'ড. দীনেশচন্দ্র সেন', 0),
(271, 67, 'ড. আশুতোষ ভট্টাচার্য', 0),
(272, 68, 'মাত্রাবৃত্ত', 1),
(273, 68, 'স্বরবৃত্ত', 0),
(274, 68, 'অক্ষরবৃত্ত', 0),
(275, 68, 'কোনোটিই নয়', 0),
(276, 69, '৪৬ টি', 0),
(277, 69, 'সাড়ে ৪৬ টি', 1),
(278, 69, '৪৯ টি', 0),
(279, 69, '৫০ টি', 0),
(280, 70, 'কাহ্নপা', 0),
(281, 70, 'লুইপা', 1),
(282, 70, 'কুক্করীপা', 0),
(283, 70, 'শবরপা', 0),
(284, 71, 'কাহ্নপা', 0),
(285, 71, 'লুই পা', 0),
(286, 71, 'ডাকাবর্ন', 0),
(287, 71, 'মুনিদত্ত', 1),
(288, 71, 'কোনটিই নয়', 0),
(289, 72, 'ডক্টর মুহাম্মদ শহীদুল্লাহ', 0),
(290, 72, 'ডক্টর সুনীতিকুমার চট্রােপাধ্যায়', 0),
(291, 72, 'হরপ্রসাদ শাস্ত্রী', 1),
(292, 72, 'ডক্টর সুকুমার সেন', 0),
(293, 73, 'ডক্টর মুহম্মদ শহীদুল্লাহ', 0),
(294, 73, 'হরপ্রসাদ শাস্ত্রী', 1),
(295, 73, 'ডক্টর সুনীতিকুমার চট্টোপাধ্যায়', 0),
(296, 73, 'ডক্টর সুকুমার সেন', 0),
(297, 74, 'শবরপা', 0),
(298, 74, 'কাহ্নপা', 1),
(299, 74, 'ডোম্বী পা', 0),
(300, 74, 'ভুসুকু পা', 0),
(301, 75, '১৮৯০', 0),
(302, 75, '১৯০২', 0),
(303, 75, '১৯০৭', 1),
(304, 75, '১৯১০', 0),
(305, 76, 'বাঁকুড়ার এক গৃহস্তের গোয়ালঘর', 0),
(306, 76, 'সুদূর চীন দেশ', 0),
(307, 76, 'নেপালের রাজ দরবারের গ্রন্থাগার', 1),
(308, 76, 'আরাকান রাজ্যসভার গ্রন্থাগার', 0),
(309, 77, 'ইসলাম ধর্ম', 0),
(310, 77, 'খ্রিস্ট ধর্ম', 0),
(311, 77, 'শিখ ধর্ম', 0),
(312, 77, 'বৌদ্ধধর্ম', 1),
(313, 78, 'শ্লোক', 0),
(314, 78, 'কবিতা', 0),
(315, 78, 'গান', 1),
(316, 78, 'ধাঁধা', 0),
(317, 79, 'শ্রীলঙ্কা', 0),
(318, 79, 'পশ্চিমবঙ্গ', 0),
(319, 79, 'ভুটান', 0),
(320, 79, 'নেপাল', 1),
(321, 80, 'লুই পা', 0),
(322, 80, 'ভুসুক পা', 0),
(323, 80, 'সরহ পা', 0),
(324, 80, 'কাহ্ন পা', 1),
(325, 81, '১৯০৯', 0),
(326, 81, '১৭৯৮', 0),
(327, 81, '১৯০৭', 1),
(328, 81, '১৭০৯', 0),
(329, 82, 'সনাতন হিন্দু', 0),
(330, 82, 'সহজিয়া বৌদ্ধ', 1),
(331, 82, 'জৈন', 0),
(332, 82, 'হরিজন', 0),
(333, 83, 'সপ্তম থেকে দ্বাদশ শতক', 1),
(334, 83, 'অষ্টম থেকে চতুর্দশ শতক', 0),
(335, 83, 'নবম থেকে চতুর্দশ', 0),
(336, 83, 'দশম থেকে চতুর্দশ শতক', 0),
(337, 84, '২৩', 0),
(338, 84, '২৪', 1),
(339, 84, '২৫', 0),
(340, 84, '২৬', 0),
(341, 84, 'কোনোটিই নয়', 0),
(342, 85, 'বড় চন্ডীদাস', 0),
(343, 85, 'বসন্তরঞ্জন রায়', 0),
(344, 85, 'হরপ্রসাদ শাস্ত্রী', 1),
(345, 85, 'দীনেশ সেন', 0),
(346, 85, 'কোনোটিই নয়', 0),
(347, 86, 'কাহ্ন পা', 0),
(348, 86, 'লুই পা', 0),
(349, 86, 'ডাকার্ণব', 0),
(350, 86, 'মুনিদত্ত', 1),
(351, 86, 'কোনোটিই নয়', 0),
(352, 87, 'কাহ্ন পা', 0),
(353, 87, 'লুই পা', 0),
(354, 87, 'ডাকার্ণব', 0),
(355, 87, 'মুনিদত্ত', 1),
(356, 87, 'কোনোটিই নয়', 0),
(357, 88, 'আদিযুগ', 1),
(358, 88, 'মধ্যযুগ', 0),
(359, 88, 'আধুনিক যুগ', 0),
(360, 88, 'অতি আধুনিক যুগ', 0),
(361, 88, 'কোনোটিই নয়', 0),
(362, 89, 'সুনীতি কুমার চট্টোপাধ্যায়', 0),
(363, 89, 'ভারতচন্দ্র রায় গুণাকর', 0),
(364, 89, 'হরপ্রসাদ শাস্ত্রী', 1),
(365, 89, 'প্রবোধচন্দ্র বাগচী', 0),
(366, 89, 'রবীন্দ্রনাথ ঠাকুর', 0),
(367, 90, 'ছড়া', 0),
(368, 90, 'গল্প', 0),
(369, 90, 'গান', 1),
(370, 90, 'রম্যরচনা', 0),
(371, 91, 'পাল আমলে', 1),
(372, 91, 'সেন আমলে', 0),
(373, 91, 'গুপ্ত আমলে', 0),
(374, 91, 'পাঠান আমলে', 0),
(375, 91, 'কোনটিই নয়', 0),
(376, 92, '২৩', 0),
(377, 92, '২৪', 1),
(378, 92, '২৫', 0),
(379, 92, '২৬', 0),
(380, 92, 'কোনটিই নয়', 0),
(381, 93, 'অক্ষরবৃত্ত', 0),
(382, 93, 'মাত্রাবৃত্ত', 1),
(383, 93, 'স্বরবৃত্ত', 0),
(384, 93, 'ধ্বনিবৃত্ত', 0),
(385, 94, 'ভুসুকুপা', 1),
(386, 94, 'কাহ্নপা', 0),
(387, 94, 'শবরপা', 0),
(388, 94, 'লুইপা', 0),
(389, 95, 'একগুচ্ছ ধর্মোপদেশ', 0),
(390, 95, 'সাধন সংগীত', 1),
(391, 95, 'জীবনাচরণ পদ্ধতি', 0),
(392, 95, 'দেবী বন্দনা', 0),
(393, 96, 'প্রেম বিষয়ক গান', 0),
(394, 96, 'সাধন সম্পর্কিত গীত', 1),
(395, 96, 'জীবন যাপনের চিত্র', 0),
(396, 96, 'সমাজ জীবনের ছবি', 0),
(397, 97, 'কাহ্নপা', 0),
(398, 97, 'মবরপা', 0),
(399, 97, 'ঢেন্ডপা', 0),
(400, 97, 'লুইপা', 1),
(401, 98, 'অক্ষরবৃত্ত', 0),
(402, 98, 'মাত্রবৃত্ত', 1),
(403, 98, 'স্বরবৃত্ত', 0),
(404, 98, 'অমিত্রাক্ষর ছন্দ', 0),
(405, 99, 'প্রতিবেশীর প্রতি ভালোবাসা', 0),
(406, 99, 'আত্মীয়ের প্রতি ভালোবাসা', 0),
(407, 99, 'দারিদ্র্যক্লিষ্ট জীবনের চিত্র', 1),
(408, 99, 'একাকীত্বের কথা', 0),
(409, 100, 'ড. মুহাম্মদ শহীদুল্লাহ', 0),
(410, 100, 'বসন্তরঞ্জন রায় বিদ্বদ্বল্লভ', 0),
(411, 100, 'হরপ্রসাদ শাস্ত্রী', 1),
(412, 100, 'ড. দীনেশচন্দ্র সেন', 0),
(413, 101, 'বাংলা ভাষার আদি নির্দশন ‘চর্যাপদ’ হ্রপ্রসাদ শাস্ত্রী কর্তৃক ১৯০৭ সালে নেপালের রাজদরবারের গ্রন্থশালা থেকে আবিষ্কৃত হয়।', 1),
(414, 101, '-', 0),
(415, 101, '-', 0),
(416, 102, 'কৈলারে', 0),
(417, 102, 'ঊড়িষা', 0),
(418, 102, 'আসাম', 0),
(419, 102, 'নেপালের রাজগ্রন্থাগার', 1),
(420, 103, 'শবরপা', 1),
(421, 103, 'কৃত্তিবাস', 0),
(422, 103, 'বিদ্যাপতি', 0),
(423, 103, 'জয়দেব', 0),
(424, 104, 'প্রেম বিষয়ক গান', 0),
(425, 104, 'সাধন সম্পর্কিত গীত', 1),
(426, 104, 'জীবন যাপনের চিত্র', 0),
(427, 104, 'সমাজ জীবনের ছবি', 0),
(428, 105, '৪১ টি', 0),
(429, 105, '৫১ টি', 1),
(430, 105, '৫৬ টি', 0),
(431, 105, '৬২ টি', 0),
(432, 106, 'লুইপা', 1),
(433, 106, 'কাহুপা', 0),
(434, 106, 'ঢেণ্ডনপা', 0),
(435, 106, 'শবরপা', 0),
(436, 107, 'লুইপা', 0),
(437, 107, 'কাহ্নপা', 1),
(438, 107, 'ভুসুকুপা', 0),
(439, 107, 'শবরপা', 0),
(440, 108, 'কাহ্নপা', 0),
(441, 108, 'শবরুপা', 0),
(442, 108, 'টেণ্ডনপা', 0),
(443, 108, 'লুইপা', 1),
(444, 109, 'অক্ষরবৃত্ত', 0),
(445, 109, 'মাত্রাবৃত্ত', 1),
(446, 109, 'স্বরবৃত্ত', 0),
(447, 109, 'অমিত্রাক্ষর ছন্দ', 0),
(448, 110, 'খ্রিস্টধর্ম', 0),
(449, 110, 'প্যাগনিজম', 0),
(450, 110, 'জৈনধর্ম', 0),
(451, 110, 'বৌদ্ধধর্ম', 1),
(452, 111, 'অক্ষরবৃত্ত', 0),
(453, 111, 'মাত্রাবৃত্ত', 1),
(454, 111, 'স্বরবৃত্ত', 0),
(455, 111, 'অমিত্রাক্ষর ছন্দ', 0),
(456, 112, 'সৈয়দ মোহাম্মদ শাহেদ', 1),
(457, 112, 'হরপ্রসাদ শাস্ত্রী', 0),
(458, 112, 'আনিসুজ্জামান', 0),
(459, 112, 'ড. মুহম্মদ শহীদুল্লাহ', 0),
(460, 113, 'শবরপা', 1),
(461, 113, 'বিদ্যাপতি', 0),
(462, 113, 'চণ্ডীদাস', 0),
(463, 113, 'ভারতচন্দ্র', 0),
(464, 114, 'লুই পা', 1),
(465, 114, 'শবর পা', 0),
(466, 114, 'ভুসুকু পা', 0),
(467, 114, 'কাহ্ন পা', 0),
(468, 115, 'শ্রীকৃষ্ণকীর্তন', 0),
(469, 115, 'মনসামঙ্গল', 0),
(470, 115, 'চণ্ডীমঙ্গল', 0),
(471, 115, 'চর্যাপদ', 1),
(472, 116, 'চণ্ডীমঙ্গল', 0),
(473, 116, 'মনসামঙ্গল', 0),
(474, 116, 'চর্যাপদ', 1),
(475, 116, 'জঙ্গনমা', 0),
(476, 117, 'খ্রিষ্টধর্ম', 0),
(477, 117, 'প্যাগনিজম', 0),
(478, 117, 'জৈনধর্ম', 0),
(479, 117, 'বৌদ্ধধর্ম', 1),
(480, 118, 'নীতি চর্চা', 0),
(481, 118, 'ধর্ম চর্চা', 1),
(482, 118, 'সাহিত্য চর্চা', 0),
(483, 118, 'অনুবাদ চর্চা', 0),
(484, 119, 'মীননাথ', 0),
(485, 119, 'প্রবোধচন্দ্র বাগচী', 0),
(486, 119, 'হরপ্রসাদ শাস্ত্রী', 0),
(487, 119, 'মুনিদত্ত', 1),
(488, 120, 'চর্যাপদ', 1),
(489, 120, 'বৈষ্ণব পদাবলি', 0),
(490, 120, 'ঐতরেয় আরণ্যক', 0),
(491, 120, 'দোহাকোষ', 0),
(492, 121, '১৮০৭', 0),
(493, 121, '১৯০৭', 1),
(494, 121, '১৯০৯', 0),
(495, 121, '১৮০৯', 0),
(496, 122, 'অক্ষরবৃত্ত', 0),
(497, 122, 'মাত্রাবৃত্ত', 1),
(498, 122, 'স্বরবৃত্ত', 0),
(499, 122, 'কোনোটিই নয়', 0),
(500, 123, 'কাহপা', 0),
(501, 123, 'ঢেগুনপা', 0),
(502, 123, 'লুইপা', 1),
(503, 123, 'ভুসুকুপা', 0),
(504, 124, 'ভারতচন্দ্র', 0),
(505, 124, 'শবরপা', 1),
(506, 124, 'বিদ্যাপতি', 0),
(507, 124, 'জন্ডীদাস', 0),
(508, 125, 'বসন্তরঞ্জন রায় বিদ্বদ্বল্লভ', 0),
(509, 125, 'শাহ মুহাম্মদ সগীর', 0),
(510, 125, 'দক্ষিণারঞ্জন মিত্র মজুমদার', 0),
(511, 125, 'হরপ্রসাদ শাস্ত্রী', 1),
(512, 126, 'Buddist Mystic Songs', 1),
(513, 126, 'চর্যাগীতিকা', 0),
(514, 126, 'চর্যাগীতিকোষ', 0),
(515, 126, 'হাজার বছরের পুরান বাংলা ভাষার বৌদ্ধগান ও দোহা', 0),
(516, 127, 'বাংলাদেশ', 0),
(517, 127, 'নেপাল', 1),
(518, 127, 'উড়িষ্যা', 0),
(519, 127, 'ভুটান', 0),
(520, 128, 'একগুচ্ছ ধর্মোপদেশ', 0),
(521, 128, 'সাধন সংগীত', 1),
(522, 128, 'জীবনাচরণ পদ্ধতি', 0),
(523, 128, 'দেবী বন্দনা', 0),
(524, 129, 'সমাজচিত্র', 1),
(525, 129, 'জীবনভাবনা', 0),
(526, 129, 'ভাষঅ', 0),
(527, 129, 'কাব্যিকতা', 0),
(528, 130, 'মাত্রাবৃত্ত', 1),
(529, 130, 'স্বরবৃত্ত', 0),
(530, 130, 'অমিত্রাক্ষর ছন্দ্র', 0),
(531, 130, 'অক্ষরবৃত্ত', 0),
(532, 131, 'মুহম্মদ শহীদুল্লাহ', 0),
(533, 131, 'সুনীতিকুমার চট্টোপাধ্যায়', 0),
(534, 131, 'হরপ্রাসাদ শাস্ত্রী', 1),
(535, 131, 'সুকুমার সেন', 0),
(536, 132, 'দীনেশচন্দদ্র সেন', 0),
(537, 132, 'ঈম্বরচন্দ্র গুপ্ত', 0),
(538, 132, 'কালিদাস রায়', 0),
(539, 132, 'হরপ্রসাদ শাস্ত্রী', 1),
(540, 133, 'প্রাচীন যুগ', 1),
(541, 133, 'মধ্যযুগ', 0),
(542, 133, 'অন্ধাকর যুগ', 0),
(543, 133, 'আধুনিক যুগ', 0),
(544, 134, '৩৪ জন', 0),
(545, 134, '৩০ জন', 0),
(546, 134, '২৫ জন', 0),
(547, 134, '২৪ জন', 1),
(548, 135, '১৮০০', 0),
(549, 135, '১৮৫৭', 0),
(550, 135, '১৯০৭', 1),
(551, 135, '১৯০৯', 0),
(552, 136, 'গানের সংকলন', 1),
(553, 136, 'কবিতার সংকলন', 0),
(554, 136, 'প্রবন্ধের সংকলন', 0),
(555, 136, 'কোনোটাই নয়', 0),
(556, 137, 'ভারত', 0),
(557, 137, 'নেপাল', 1),
(558, 137, 'বাংলাদেশ', 0),
(559, 137, 'ভুটান', 0),
(560, 138, 'ড. মুহাম্মদ মহীদুল্লাহ', 0),
(561, 138, 'নীহারঞ্জজন রায়', 0),
(562, 138, 'হরপ্রসাদ শাস্ত্রী', 1),
(563, 138, 'আর সি মজুমদার', 0),
(564, 139, 'অক্ষরবৃত্ত', 0),
(565, 139, 'মাত্রাবৃত্ত', 1),
(566, 139, 'স্বরবৃত্ত', 0),
(567, 139, 'অমিত্রাক্ষর', 0),
(568, 140, 'চর্যাপদ', 1),
(569, 140, 'মঙ্গলবাক্য', 0),
(570, 140, 'বৈষ্ণ পদাবলি', 0),
(571, 140, 'জীবনী সাহিত্য', 0),
(572, 141, '১৮০৭', 0),
(573, 141, '১৯০৭', 1),
(574, 141, '১৯০৯', 0),
(575, 141, '১২০৭', 0),
(576, 142, 'নেপালের রাজদরবার', 1),
(577, 142, 'ভারতের গ্রন্থাগার', 0),
(578, 142, 'শ্রীলঙ্কার গ্রন্থাগার', 0),
(579, 142, 'চীনের রাজদরবার', 0),
(580, 143, 'কবিতার সংকলন', 0),
(581, 143, 'গানের সংকলন', 1),
(582, 143, 'প্রবন্ধের সংকলন', 0),
(583, 143, 'দেবী বন্দনা', 0),
(584, 144, '২৩ জনের', 0),
(585, 144, '২৪ জনের', 1),
(586, 144, '৩৪ জনের', 0),
(587, 144, '২১ জনের', 0),
(588, 145, 'সান্ধ্য ভাষা', 1),
(589, 145, 'ব্রজবুলী ভাষা', 0),
(590, 145, 'বাংলা ভাষা', 0),
(591, 145, 'মৈথিলি ভাষা', 0),
(592, 146, '১৯০৫ সালে', 0),
(593, 146, '১৯০৬ সালে', 0),
(594, 146, '১৯০৭ সালে', 1),
(595, 146, '১৯০৮ সালে', 0),
(596, 147, 'লুইপা', 1),
(597, 147, 'কাহ্নপা', 0),
(598, 147, 'ভুসুকুপা', 0),
(599, 147, 'শবরপা', 0),
(600, 148, 'অক্ষরবৃত্ত', 0),
(601, 148, 'মাত্রাবৃত্ত', 1),
(602, 148, 'স্বরবৃত্ত', 0),
(603, 148, 'অমিত্রাক্ষর ছন্দ', 0),
(604, 149, 'নেপালের রাজদরবার থেকে', 1),
(605, 149, 'কলকাতা থেকে', 0),
(606, 149, 'ভুটানের রাজদরবার থেকে', 0),
(607, 149, 'মায়ানমারের রাজদরবার থেকে', 0),
(608, 150, 'সাড়ে ছেচল্লিশটি', 1),
(609, 150, 'একান্নটি', 0),
(610, 150, 'আটচল্লিটি', 0),
(611, 150, 'উনপঞ্চাশটি', 0),
(612, 151, 'নীতিচর্চা', 0),
(613, 151, 'ধর্মচর্চা', 1),
(614, 151, 'সাহিত্য চর্চা', 0),
(615, 151, 'অনুবাদ চর্চা', 0),
(616, 152, 'অক্ষরবৃত্ত', 0),
(617, 152, 'মাত্রাবৃত্ত', 1),
(618, 152, 'স্বরবৃত্ত', 0),
(619, 152, 'অমিত্রাক্ষর ছন্দ', 0),
(620, 153, 'লুইপা', 0),
(621, 153, 'কাহ্নপা', 1),
(622, 153, 'শরপা', 0),
(623, 153, 'ভুসুকুপা', 0),
(624, 154, 'শবরপা', 0),
(625, 154, 'ভুসুকুপা', 0),
(626, 154, 'লুইপা', 1),
(627, 154, 'কাহ্নপা', 0),
(628, 155, 'মুনিদত্ত', 0),
(629, 155, 'প্রবোধচন্দ্র বাগচী', 0),
(630, 155, 'কীর্তিচন্দ্ৰ', 1),
(631, 155, 'হরপ্রসাদ শাস্ত্রী', 0),
(632, 156, 'কাহ্নপা', 0),
(633, 156, 'ঢেণ্ডনপা', 0),
(634, 156, 'লুইপা', 1),
(635, 156, 'ভূসুকুপা', 0),
(636, 157, 'মুহম্মদ শহীদুল্লাহ', 0),
(637, 157, 'সুনীতিকুমার চট্টোপাধ্য়ায়', 0),
(638, 157, 'হরপ্রসাদ শাস্ত্রী', 1),
(639, 157, 'বিজয়চন্দ্র মজুমদার', 0),
(640, 158, 'চর্যাগীতিকা', 1),
(641, 158, 'শূন্যপুরাণ', 0),
(642, 158, 'শেখ শুভোদয়া', 0),
(643, 158, 'বৈষ্ণব পদাবলি', 0),
(644, 159, 'লুইপা', 0),
(645, 159, 'সবরপা', 0),
(646, 159, 'ভুসুকুপা', 0),
(647, 159, 'কাহ্নপা', 1),
(648, 160, 'হরপ্রসাদ শাস্ত্রী', 0),
(649, 160, 'সুকুমার সেন', 0),
(650, 160, 'ডা. মোহাম্মদ শহীদুল্লাহ', 0),
(651, 160, 'সুনীতি কুমার চট্টোপাধ্যায়', 1),
(652, 161, 'লুই পা', 0),
(653, 161, 'কাহ্ন পা', 1),
(654, 161, 'কুক্কুরী পা', 0),
(655, 161, 'ভুসুকু পা', 0),
(656, 162, 'লুইপা', 0),
(657, 162, 'কাহ্নপা', 1),
(658, 162, 'কুকুরিপা', 0),
(659, 162, 'উপরের একটিও না', 0),
(660, 163, 'মিয়ানমার', 0),
(661, 163, 'ভারত', 0),
(662, 163, 'বাংলাদেশ', 0),
(663, 163, 'নেপাল', 1),
(664, 164, 'পাল', 1),
(665, 164, 'সেন', 0),
(666, 164, 'মোগল', 0),
(667, 164, 'তুর্কি', 0),
(668, 165, 'পদ্য', 0),
(669, 165, 'গান', 1),
(670, 165, 'শ্লোক', 0),
(671, 165, 'মন্ত্ৰ', 0),
(672, 166, 'কৃত্তিবাস, চন্দ্রাবতী, কাশীরাম দাস', 0),
(673, 166, 'বিজয়গুপ্ত, মালাধর বসু, দ্বিজ মাধব', 0),
(674, 166, 'চণ্ডীদাস, বিদ্যাপতি, জ্ঞানদাস', 0),
(675, 166, 'লুই পা, ভুসুক পা, শবর পা', 1),
(676, 167, 'প্রবোধচন্দ্র বাগচী', 1),
(677, 167, 'যতীন্দ্র মোহন বাগচী', 0),
(678, 167, 'প্রফুল্ল মোহন বাগচী', 0),
(679, 167, 'প্রণয়ভূষণ বাগচী', 0),
(680, 168, 'কাহ্নপা', 1),
(681, 168, 'ভুসুকুপা', 0),
(682, 168, 'সরহপা', 0),
(683, 168, 'লুইপা', 0),
(684, 169, '১০নং পদ', 0),
(685, 169, '১৬নং পদ', 0),
(686, 169, '১৮নং পদ', 0),
(687, 169, '২৩ নং পদ', 1),
(688, 170, 'আদিযুগ', 1),
(689, 170, 'মধ্যযুগ', 0),
(690, 170, 'আধুনিক যুগ', 0),
(691, 170, 'অতি আধুনিক', 0),
(692, 171, '১৮ নং পদ', 0),
(693, 171, '১৬ নং পদ', 0),
(694, 171, '২৩ নং পদ', 1),
(695, 171, '১০ নং পদ', 0),
(696, 172, 'উপন্যাসধর্মী', 0),
(697, 172, 'কাব্যধর্মী', 1),
(698, 172, 'আত্মজীবনী', 0),
(699, 172, 'ভ্রমনকাহিনী', 0),
(700, 173, 'লুইপা', 0),
(701, 173, 'কাহ্নপা', 1),
(702, 173, 'শরৎচন্দ্র চট্টোপাধ্যায়', 0),
(703, 173, 'নজরুল ইসলাম', 0),
(704, 174, 'বাংলাদেশ', 0),
(705, 174, 'নেপাল', 1),
(706, 174, 'উড়িয্যা', 0),
(707, 174, 'ভুটান', 0),
(708, 175, 'শ্রীকৃষ্ণকীর্তন', 0),
(709, 175, 'মনসামঙ্গল', 0),
(710, 175, 'চন্ডীমঙ্গল', 0),
(711, 175, 'চর্যাপদ', 1),
(712, 176, '১৮০০', 0),
(713, 176, '১৮৫৭', 0),
(714, 176, '১৯০৭', 1),
(715, 176, '১৯০৯', 0),
(716, 177, 'চর্যাপদ', 1),
(717, 177, 'পদাবলি', 0),
(718, 177, 'মঙ্গলকাব্য', 0),
(719, 177, 'রোমান্সকাব্য', 0),
(720, 178, 'পাল', 1),
(721, 178, 'সেন', 0),
(722, 178, 'তুর্কি', 0),
(723, 178, 'কোনটিই নয়', 0),
(724, 179, '৫টি', 0),
(725, 179, '৭টি', 0),
(726, 179, '৬টি', 1),
(727, 179, '৮টি', 0),
(728, 180, '১২টি', 0),
(729, 180, 'সাড়ে ১২টি', 0),
(730, 180, '১৩টি', 1),
(731, 180, '১০টি', 0),
(732, 181, 'আর্যদেব', 0),
(733, 181, 'লুই পা', 0),
(734, 181, 'কাহ্ন পা', 0),
(735, 181, 'ভুসুকু পা', 1),
(736, 182, '২৪ জন', 1),
(737, 182, '২৬ জন', 0),
(738, 182, '২৩ জন', 0),
(739, 182, '২৫ জন', 0),
(740, 183, '১৯০৭', 1),
(741, 183, '১৯১৬', 0),
(742, 183, '১৯১০', 0),
(743, 183, '১৯০৬', 0),
(744, 184, 'চন্ডীদাস, বিদ্যাপতি, জ্ঞানদাস', 0),
(745, 184, 'লুইপা, ভুসুকুপা, শবরপা', 1),
(746, 184, 'কৃত্তিবাস, কাশীরাম, আলাওল', 0),
(747, 184, 'বিজয়গুপ্ত, মালাধর বসু, দ্বিজমাধব', 0),
(748, 185, 'শ্রীকৃষ্ণকীর্তন', 0),
(749, 185, 'চর্যাপদ', 1),
(750, 185, 'বৈষ্ণব পদাবলী', 0),
(751, 185, 'মঙ্গলকাব্য', 0),
(752, 186, 'স্বরবৃত্ত', 0),
(753, 186, 'নিম্নবৃত্ত', 0),
(754, 186, 'অক্ষরবৃত্ত', 0),
(755, 186, 'মাত্রাবৃত্ত', 1),
(756, 187, 'মুহম্মদ শহীদুল্লাহ', 0),
(757, 187, 'মুনিদত্ত', 1),
(758, 187, 'হরপ্রসাদ শাস্ত্রী', 0),
(759, 187, 'মীননাথ', 0),
(760, 188, '১৯০৭ সালে', 1),
(761, 188, '১৯১০ সালে', 0),
(762, 188, '১৯১৬ সালে', 0),
(763, 188, '১৯২০ সালে', 0),
(764, 189, 'সুনীতিকুমার চট্টোপাধ্যায়', 1),
(765, 189, 'বিধু শেখর শাস্ত্রী', 0),
(766, 189, 'হরপ্রসাদ শাস্ত্রী', 0),
(767, 189, 'প্রবোধকুমার বাগচী', 0),
(768, 190, 'সুনীতিকুমার চট্টোপাধ্যায়', 1),
(769, 190, 'বিধু শেখর শাস্ত্রী', 0),
(770, 190, 'হরপ্রসাদ শাস্ত্রী', 0),
(771, 190, 'প্রবোধ কুমার বাগচী', 0),
(772, 191, '১৯০৭', 1),
(773, 191, '১৯১৬', 0),
(774, 191, '১৯১৯', 0),
(775, 191, '১৯০৫', 0),
(776, 192, 'কাহ্নপা', 0),
(777, 192, 'ভুসুকুপা', 0),
(778, 192, 'লুইপা', 1),
(779, 192, 'শবরপা', 0),
(780, 193, 'বাংলাদেশ', 0),
(781, 193, 'নেপাল', 1),
(782, 193, 'উড়িষ্যা', 0),
(783, 193, 'ভুটান', 0),
(784, 194, 'শ্রীকৃষ্ণকীর্তন', 0),
(785, 194, 'শূন্যপুরান', 0),
(786, 194, 'হুতুম প্যাঁচার নকশা', 0),
(787, 194, 'চর্যাপদ', 1),
(788, 195, 'চর্যাপদ', 1),
(789, 195, 'শ্রীকৃষ্ণ কীর্তন কাব্য', 0),
(790, 195, 'বঙ্গবাণী', 0),
(791, 195, 'অন্নদামঙ্গল কাব্য', 0),
(792, 196, 'হরপ্রসাদ শাস্ত্রী', 0),
(793, 196, 'সুনীতিকুমার চট্টোপাধ্যায়', 1),
(794, 196, 'সুকুমার সেন', 0),
(795, 196, 'ড. মুহাম্মদ শহীদুল্লাহ', 0),
(796, 197, 'লোকসাহিত্য', 0),
(797, 197, 'ব্রজবুলি', 0),
(798, 197, 'চর্যাপদ', 1),
(799, 197, 'বৈষ্ণব গীতিকা', 0),
(800, 198, 'গাছের শাখা', 0),
(801, 198, 'বংশ', 0),
(802, 198, 'ইন্দ্রিয়', 1),
(803, 198, 'মৃত্যু', 0),
(804, 199, 'কাহ্নপা', 0),
(805, 199, 'ভুসুকুপা', 1),
(806, 199, 'লুইপা', 0),
(807, 199, 'শবরপা', 0),
(808, 200, '১৯০৭', 1),
(809, 200, '১৯০৬', 0),
(810, 200, '১৯০৫', 0),
(811, 200, '১৯০৪', 0),
(812, 201, '১৯১৬', 0),
(813, 201, '১৯০৬', 0),
(814, 201, '১৯০৭', 1),
(815, 201, '১৯০৪', 0),
(816, 202, 'মহাঘানী বৌদ্ধ', 0),
(817, 202, 'বজ্রঘানী বৌদ্ধ', 0),
(818, 202, 'বাউল', 0),
(819, 202, 'সহজঘানী বৌদ্ধ', 1),
(820, 203, 'রামায়ণ', 0),
(821, 203, 'শ্রীকৃষ্ণকীর্তন', 0),
(822, 203, 'শূন্যপুরাণ', 0),
(823, 203, 'চর্যাপদ', 1),
(824, 204, 'ভুসুকুপা', 0),
(825, 204, 'ঢেগুণ পা', 1),
(826, 204, 'লুইকুপা', 0),
(827, 204, 'দরকুপা', 0),
(828, 205, 'Buddhist Mystic Songs', 1),
(829, 205, 'চর্যাগীতিকা', 0),
(830, 205, 'চর্যাগীতিকোষ', 0),
(831, 205, 'হাজার বছরের পুরাণ বাংলা ভাষায় বৌদ্ধগান ও দোহা', 0),
(832, 206, 'কাহ্নপা', 0),
(833, 206, 'শবরপা', 0),
(834, 206, 'লুইপা', 1),
(835, 206, 'ভুসুকুপা', 0),
(836, 207, 'শ্রীকৃষ্ণকীর্তন', 1),
(837, 207, 'বৈষ্ণব পদাবলী', 0),
(838, 207, 'লাইলি মজনু', 0),
(839, 207, 'পদ্মাবতী', 0),
(840, 208, 'ড. মুহম্মদ শহীদুল্লাহ', 0),
(841, 208, 'দীনেশ চন্দ্র সেন', 0),
(842, 208, 'হরপ্রসাদ শাস্ত্রী', 1),
(843, 208, 'সুনীতি কুমার চট্টোপাধ্যায়', 0),
(844, 209, 'লোকগীতি', 0),
(845, 209, 'পদাবলী', 0),
(846, 209, 'চর্যাপদ', 1),
(847, 209, 'পদ্মাবতী', 0),
(848, 210, 'ভুটান', 0),
(849, 210, 'শ্রীলঙ্কা', 0),
(850, 210, 'ভারত', 0),
(851, 210, 'নেপাল', 1),
(852, 210, 'পাকিস্তান', 0),
(853, 211, 'মহাযানী', 0),
(854, 211, 'সহজযানী', 1),
(855, 211, 'হীনযানী', 0),
(856, 211, 'বজ্রযানী', 0),
(857, 211, 'কোনটিই নয়', 0),
(858, 212, 'শ্রীকৃষ্ণকীর্তন', 0),
(859, 212, 'চর্যাপদ', 1),
(860, 212, 'মঙ্গলকাব্য', 0),
(861, 212, 'আলালের ঘরে দুলাল', 0),
(862, 213, 'লুইপা', 0),
(863, 213, 'কাহ্নপা', 1),
(864, 213, 'সরহ পা', 0),
(865, 213, 'শবর পা', 0),
(866, 214, 'কাহ্ন পা', 0),
(867, 214, 'লুই পা', 0),
(868, 214, 'ভুসুকু পা', 1),
(869, 214, 'শবর পা', 0),
(870, 215, 'কাহ্নপা', 0),
(871, 215, 'ভূষুকুপা', 0),
(872, 215, 'লুইপা', 1),
(873, 215, 'শবরপা', 0),
(874, 216, 'চাটিল', 0),
(875, 216, 'ভুসুকুপা', 0),
(876, 216, 'কাহ্নপা', 1),
(877, 216, 'মহিজ্ঞ', 0),
(878, 216, 'কোনটিই নয়', 0),
(879, 217, 'লুইপা', 0),
(880, 217, 'কাহ্নপা', 1),
(881, 217, 'ভুসুকুপা', 0),
(882, 217, 'ক্কুকুরীপা', 0),
(883, 218, 'নীতি চর্চা', 0),
(884, 218, 'ধর্ম চর্চা', 1),
(885, 218, 'সাহিত্য চর্চা', 0),
(886, 218, 'গান চর্চা', 0),
(887, 219, 'চণ্ডীদাস', 0),
(888, 219, 'বৌদ্ধ বিজয়গুপ্ত', 0),
(889, 219, 'সরহপা', 1),
(890, 219, 'আলাওল', 0),
(891, 220, 'চণ্ডীদাস', 0),
(892, 220, 'বৌদ্ধ বিজয়গুপ্ত', 0),
(893, 220, 'সরহপা', 1),
(894, 220, 'আলাওল', 0),
(895, 221, 'চণ্ডীদাস', 0),
(896, 221, 'বৌদ্ধ বিজয়গুপ্ত', 0),
(897, 221, 'সরহপা', 1),
(898, 221, 'আলাওল', 0),
(899, 222, 'চন্ডীদাস', 0),
(900, 222, 'জ্ঞানদাস', 1),
(901, 222, 'বিদ্যাপতি', 0),
(902, 222, 'গোবিন্দদাস', 0),
(903, 223, '১৮০৭', 0),
(904, 223, '১৮১০', 0),
(905, 223, '১৯০৭', 1),
(906, 223, '১৯১০', 0),
(907, 224, 'কাহ্নপা', 0),
(908, 224, 'সরহপা', 0),
(909, 224, 'ভুসুকুপা', 0),
(910, 224, 'কঙ্কণপা', 1),
(911, 225, 'একগুচ্ছ ধর্মোপদেশ', 0),
(912, 225, 'সাধন সংগীত', 1),
(913, 225, 'জীবনাচরণ পদ্ধতি', 0),
(914, 225, 'নীতিকথা', 0),
(915, 226, '২১ জন', 0),
(916, 226, '২২ জন', 0),
(917, 226, '২৩ জন', 0),
(918, 226, '২৪ জন', 1),
(919, 227, 'মনসামঙ্গল', 0),
(920, 227, 'চণ্ডীমঙ্গল', 0),
(921, 227, 'চর্যাপদ', 1),
(922, 227, 'শ্রীকৃষ্ণকীর্তন', 0),
(923, 228, 'চর্যাপদ', 1),
(924, 228, 'মঙ্গলকাব্য', 0),
(925, 228, 'বৈষ্ণব পদাবলী', 0),
(926, 228, 'খনার বচন', 0),
(927, 229, 'সুনীতিকুমার চট্টোপাধ্যায়', 0),
(928, 229, 'হরপ্রসাদ শাস্ত্রী', 1),
(929, 229, 'রাজেন্দ্রলাল মিত্র', 0),
(930, 229, 'সুকুমার সেন', 0),
(931, 230, 'ডঃ মুহাম্মদ শহীদুল্লাহ', 0),
(932, 230, 'সুনীতিকুমার চট্টোপাধ্যায়', 0),
(933, 230, 'হরপ্রসাদ শাস্ত্রী', 1),
(934, 230, 'সুকুমার সেন', 0),
(935, 231, 'কোনটি চর্যাগান, আর কোনটি নয়', 0),
(936, 231, 'কোনটি আচরণীয়, আর কোনটি নয়', 1),
(937, 231, 'কোনটি চরাচরের, আর কোনটি নয়', 0),
(938, 231, 'কোনটি আচার্যের, আর কোনটি নয়', 0),
(939, 232, 'মদ চোয়ানো', 0),
(940, 232, 'তাঁত বোনা', 0),
(941, 232, 'চাঙারি তৈরি', 0),
(942, 232, 'উপরের তিনটিই', 1),
(943, 233, 'লুই পা', 0),
(944, 233, 'কাহ্ন পা', 0),
(945, 233, 'কুক্কুরী পা', 0),
(946, 233, 'ভুসুকুপা', 1),
(947, 234, 'কাহ্নপা', 1),
(948, 234, 'ভুসুকুপা', 0),
(949, 234, 'লুইপা', 0),
(950, 234, 'স্বরপা', 0),
(951, 235, 'সুনীতিকুমার চট্টোপাধ্যায়', 1),
(952, 235, 'বিধুশেখর শাস্ত্রী', 0),
(953, 235, 'হরপ্রসাদ শাস্ত্রী', 0),
(954, 235, 'প্রবোধকুমার বাগচী', 0),
(955, 236, 'লুইপা', 0),
(956, 236, 'শবর', 0),
(957, 236, 'কাহ্নপা', 1),
(958, 236, 'ভোম্বী', 0),
(959, 237, '৪৮টি', 0),
(960, 237, '৫০টি', 1),
(961, 237, '৫২টি', 0),
(962, 237, '৫৪টি', 0),
(963, 238, 'ড. মুহাম্মদ শহীদুল্লাহ', 0),
(964, 238, 'সুনীতিকুমার চট্টোপাধ্যায়', 1),
(965, 238, 'হরপ্রসাদ শাস্ত্রী', 0),
(966, 238, 'ড. এনামুল হক', 0),
(967, 239, 'খনার বচন', 0),
(968, 239, 'চর্যাপদ', 1),
(969, 239, 'বৈষ্ণবপদ', 0),
(970, 239, 'শ্রীকৃষ্ণকীর্তন', 0),
(971, 240, 'রামাই পণ্ডিত', 0),
(972, 240, 'হলায়ুধ মিশ্র', 0),
(973, 240, 'বড়ু চণ্ডীদাস', 1),
(974, 240, 'খনা', 0),
(975, 241, 'চন্ডীদাস', 0),
(976, 241, 'বড়ু চণ্ডীদাস', 1),
(977, 241, 'দ্বিজ চন্ডীদাস', 0),
(978, 241, 'দীন চন্ডীদাস', 0),
(979, 242, 'শ্রী রাধার ননদিনী', 0),
(980, 242, 'শ্রী রাধার শাশুড়ি', 0),
(981, 242, 'রাধাকৃষ্ণের প্রেমের দূতী', 1),
(982, 242, 'জনৈক গোপবালা', 0),
(983, 243, 'জ্ঞানদাস', 0),
(984, 243, 'দীন চণ্ডীদাস', 0),
(985, 243, 'বড়ু চণ্ডীদাস', 1),
(986, 243, 'দীনহীন চণ্ডীদাস', 0),
(987, 244, 'হরপ্রসাদ শাস্ত্রী', 0),
(988, 244, 'বডু চন্ডীদাস', 0),
(989, 244, 'বসন্তরঞ্জন রায় বিদ্বদ্বল্লভ', 1),
(990, 244, 'সুকুমার সেন', 0),
(991, 245, 'চন্ডীদাস', 0),
(992, 245, 'দ্বিজ চন্ডীদাস', 0),
(993, 245, 'বড়ু চন্ডীদাস', 1),
(994, 245, 'দীন চন্ডীদাস', 0),
(995, 246, 'পন্ডিত হরপ্রসাদ শাস্ত্রী', 0),
(996, 246, 'বসন্ত রঞ্জন রায়', 1),
(997, 246, 'রামমোহন রায়', 0),
(998, 246, 'প্রমথ চৌধুরী', 0),
(999, 247, 'হরপ্রসাদ শাস্ত্রী', 0),
(1000, 247, 'রামমোহন রায়', 0),
(1001, 247, 'বসন্তরঞ্জন রায়', 1),
(1002, 247, 'প্রমথ চৌধুরী', 0),
(1003, 248, 'চন্ডীদাস', 0),
(1004, 248, 'বড়ু চন্ডীদাস', 1),
(1005, 248, 'দীন চন্ডীদাস', 0),
(1006, 248, 'দ্বিজ চন্ডীদাস', 0),
(1007, 249, 'চণ্ডীদাস', 0),
(1008, 249, 'বড়ু চণ্ডীদাস', 1),
(1009, 249, 'দীন চণ্ডীদাস', 0),
(1010, 249, 'গোবিন্দ দাস', 0),
(1011, 250, 'রাজপ্রাসাদে', 0),
(1012, 250, 'গোয়ালঘরে', 1),
(1013, 250, 'কুঁড়েঘরে', 0),
(1014, 250, 'গ্রন্থাগারে', 0),
(1015, 251, 'বসন্তরঞ্জন রায়', 1),
(1016, 251, 'হরপ্রসাদ শাস্ত্রী', 0),
(1017, 251, 'সুকুমার সেন', 0),
(1018, 251, 'ড মুহম্মদ শহীদুল্লাহ', 0),
(1019, 252, 'পদাবলি', 0),
(1020, 252, 'ধামালি', 0),
(1021, 252, 'গ্রেমগীতি', 0),
(1022, 252, 'নাটগীতি (নাট্যগীতি)', 1),
(1023, 253, 'চন্ডীদাস', 0),
(1024, 253, 'বডু চন্ডীদাস', 1),
(1025, 253, 'দ্বিজ চন্ডীদাস', 0),
(1026, 253, 'দীন চন্ডীদাস', 0),
(1027, 254, 'জয়দেব', 0),
(1028, 254, 'মালাধর', 0),
(1029, 254, 'বডু চন্ডীদাস', 1),
(1030, 254, 'কানা হরিদত্ত', 0),
(1031, 255, '১১', 0),
(1032, 255, '১৩', 1),
(1033, 255, '১৪', 0),
(1034, 255, '১৫', 0),
(1035, 256, '১০', 0),
(1036, 256, '১১', 0),
(1037, 256, '১২', 0),
(1038, 256, '১৩', 1),
(1039, 257, 'রামাই পন্ডিত', 0),
(1040, 257, 'হলায়ূধ মিশ্র', 0),
(1041, 257, 'বড়ু চন্ডীদাস', 1),
(1042, 257, 'খনা', 0),
(1043, 257, 'কোনোটিই নয়', 0),
(1044, 258, 'হরপ্রসাদ শাস্ত্রী', 0),
(1045, 258, 'বসন্তরঞ্জন রায়', 1),
(1046, 258, 'মুহম্মদ শহীদুল্লাহ', 0),
(1047, 258, 'আশুতোষ ভট্টাচার্য', 0),
(1048, 259, 'রবীন্দ্রনাথ ঠাকুর', 0),
(1049, 259, 'ধীরেণ বসু', 0),
(1050, 259, 'যোগীন্দ্রনাথ দত্ত', 0),
(1051, 259, 'শরৎচন্দ্র চট্টোপাধ্যায়', 1),
(1052, 260, 'বডু চন্ডীদাস', 1),
(1053, 260, 'বৃন্দাবন দাস', 0),
(1054, 260, 'কাহ্নপা', 0),
(1055, 260, 'মুকুন্দরাম চক্রবর্তী', 0),
(1056, 261, 'প্রাচীন যুগ', 0),
(1057, 261, 'মধ্যযুগ', 1),
(1058, 261, 'আধুনিক যুগ', 0),
(1059, 261, 'প্রাগৈতিহাসিক যুগ', 0),
(1060, 262, '১৯০৯', 1),
(1061, 262, '১৮০৯', 0),
(1062, 262, '১৯০৭', 0),
(1063, 262, '১৭০৯', 0),
(1064, 263, 'দীন চণ্ডীদাস', 0),
(1065, 263, 'দ্বিজ চণ্ডীদাস', 0),
(1066, 263, 'বড়ু চণ্ডীদাস', 1),
(1067, 263, 'চণ্ডীদাস', 0),
(1068, 264, 'পদাবলি', 0),
(1069, 264, 'ধামালী', 0),
(1070, 264, 'প্রেমগীত', 0),
(1071, 264, 'নাট্যগীতি', 1),
(1072, 265, 'বসন্তরঞ্জন', 1),
(1073, 265, 'বড়ৃ চন্ডীদাস', 0),
(1074, 265, 'ত্রৈলোক্য আচর্য', 0),
(1075, 265, 'ব্রজসুন্দর সান্ন্যাস', 0),
(1076, 266, 'বড়ু চন্ডীদাস', 1),
(1077, 266, 'দ্বিজ চন্ডীদাস', 0),
(1078, 266, 'শ্রী চৈতন্যদেব', 0),
(1079, 266, 'কাহ্নপা', 0),
(1080, 267, 'নেপালের রাজদরবার থেকে', 0),
(1081, 267, 'গোয়ালঘর থেকে', 1),
(1082, 267, 'পাঠশালা থেকে', 0),
(1083, 267, 'কান্তজীর মন্দির থেকে', 0),
(1084, 268, 'জ্ঞানদাস', 0),
(1085, 268, 'দীন চন্ডিদাস', 0),
(1086, 268, 'বড়ু চন্ডীদাস', 1),
(1087, 268, 'দীনহীন চন্ডিদাস', 0),
(1088, 269, 'বান খন্ড', 0),
(1089, 269, 'তাম্বুল খন্ড', 0),
(1090, 269, 'কালিদাস খন্ড', 1),
(1091, 269, 'নৌকা খন্ড', 0),
(1092, 270, 'নেপালের রাজ দরবার থেকে', 0),
(1093, 270, 'গোয়ালঘর থেকে', 1),
(1094, 270, 'পাঠশালা থেকে', 0),
(1095, 270, 'মন্দির থেকে', 0),
(1096, 271, 'প্রাকৃত পৈঙ্গল', 0),
(1097, 271, 'মনসামঙ্গল', 0),
(1098, 271, 'সেকসুভোদয়া', 0),
(1099, 271, 'শ্রীকৃষ্ণকীর্তন', 1),
(1100, 272, 'শ্রীচৈতন্যদেবের জন্মস্থান', 0),
(1101, 272, 'বড়ু চণ্ডীদাসের জন্মস্থান', 0),
(1102, 272, 'চর্যাপদের প্রাপ্তিস্থান', 0),
(1103, 272, 'শ্রীকৃষ্ণকীর্তন কাব্যের প্রাপ্তিস্থান', 1),
(1104, 273, 'জন্মখণ্ড', 1),
(1105, 273, 'তাম্বুলখণ্ড', 0),
(1106, 273, 'দানখন্ড', 0),
(1107, 273, 'রাধাবিরহ', 0),
(1108, 274, 'জন্মখণ্ড', 1),
(1109, 274, 'তাম্বুলখণ্ড', 0),
(1110, 274, 'দানখন্ড', 0),
(1111, 274, 'রাধাবিরহ', 0),
(1112, 275, 'চণ্ডীমঙ্গল কাব্য', 0),
(1113, 275, 'শ্রীকৃষ্ণকীর্তন', 1),
(1114, 275, 'পদ্মাবতী', 0),
(1115, 275, 'পদ্মপুরাণ', 0),
(1116, 276, 'ভাবরস', 0),
(1117, 276, 'মধুর রস', 1),
(1118, 276, 'প্রেমরস', 0),
(1119, 276, 'লীলারস', 0),
(1120, 277, 'জ্ঞানদাস', 0),
(1121, 277, 'গোবিন্দদাস', 0),
(1122, 277, 'দ্বিজ চন্ডিদাস', 1),
(1123, 277, 'বলরাম দাস', 0),
(1124, 278, 'চন্ডীদাস', 1),
(1125, 278, 'বিদ্যাপতি', 0),
(1126, 278, 'জ্ঞানদাস', 0),
(1127, 278, 'আলাওল', 0),
(1128, 279, 'পঞ্চ রস', 1),
(1129, 279, 'ষষ্ঠ রস', 0),
(1130, 279, 'সপ্ত রস', 0),
(1131, 279, 'অষ্ট রস', 0),
(1132, 280, 'গোবিন্দ দাস', 0),
(1133, 280, 'জ্ঞানদাস', 0),
(1134, 280, 'চন্ডিদাস', 0),
(1135, 280, 'বিদ্যাপতি', 1),
(1136, 281, '৩ জন', 1),
(1137, 281, '২ জন', 0),
(1138, 281, '৪ জন', 0),
(1139, 281, '৫ জন', 0),
(1140, 282, 'শ্রী চৈতন্য', 0),
(1141, 282, 'বিদ্যাপতি', 1),
(1142, 282, 'চণ্ডীদাস', 0),
(1143, 282, 'জ্ঞানদাস', 0),
(1144, 283, 'সন্ধ্যাভাষা', 0),
(1145, 283, 'অধিভাষা', 0),
(1146, 283, 'ব্রজবুলি', 1),
(1147, 283, 'সংস্কৃত ভাষা', 0),
(1148, 284, 'জ্ঞানদাস', 1),
(1149, 284, 'চন্ডীদাস', 0),
(1150, 284, 'গোবিন্দ দাস', 0),
(1151, 284, 'দ্বিজ চন্ডীদাস', 0),
(1152, 285, 'ভাব রস', 0),
(1153, 285, 'লীলা রস', 0),
(1154, 285, 'প্রেম রস', 0),
(1155, 285, 'মধুর রস', 1),
(1156, 286, 'কানাহরি দত্ত', 0),
(1157, 286, 'মানিক দত্ত', 0),
(1158, 286, 'ভারতচন্দ্র', 0),
(1159, 286, 'দাশু রায়', 1),
(1160, 287, 'শিবায়ন ও ধর্মঠাকুর', 0),
(1161, 287, 'মনসা ও শিবমঙ্গল', 0),
(1162, 287, 'চন্ডী ও শিবায়ন', 0),
(1163, 287, 'মনসা ও চন্ডী', 1),
(1164, 288, 'রাজাদেশ প্রাপ্তি', 0),
(1165, 288, 'স্বপ্নে দেবী কর্তৃক আদেশ লাভ', 1),
(1166, 288, 'রাজা ও সভাসদের মনোরঞ্জন করা', 0),
(1167, 288, 'রাজকবির দায়িত্ব পালন', 0),
(1168, 289, 'ভারতচন্দ্র', 0),
(1169, 289, 'বড়ু চন্ডীদাস', 1),
(1170, 289, 'মুকুন্দরাম চক্রবর্তী', 0),
(1171, 289, 'বিজয় গুপ্ত', 0),
(1172, 290, 'লক্ষ্মীন্দর দেবী', 0),
(1173, 290, 'পদ্মাবতী দেবী', 0),
(1174, 290, 'মনসা দেবী', 1),
(1175, 290, 'বেহুলা ও চাঁদসুন্দর', 0),
(1176, 291, 'চন্ডীমঙ্গল', 0),
(1177, 291, 'ধর্মমঙ্গল', 0),
(1178, 291, 'অন্নদামঙ্গল', 0),
(1179, 291, 'মনসামঙ্গল', 1),
(1180, 292, 'ধনপতি সদাগর', 0),
(1181, 292, 'লাউ সেন', 0),
(1182, 292, 'কালকেতু', 0),
(1183, 292, 'চাঁদ সদাগর', 1),
(1184, 293, 'অন্নদামঙ্গল', 0),
(1185, 293, 'ধর্মমঙ্গল', 0),
(1186, 293, 'চন্ডীমঙ্গল', 0),
(1187, 293, 'মনসামঙ্গল', 1),
(1188, 294, 'মনসাঙ্গল', 1),
(1189, 294, 'অন্নদামঙ্গল', 0),
(1190, 294, 'শীতলামঙ্গল', 0),
(1191, 294, 'সারদামঙ্গল', 0),
(1192, 295, 'মনসামঙ্গল কাব্যে', 0),
(1193, 295, 'অন্নদামঙ্গল কাব্যে', 0),
(1194, 295, 'চণ্ডীমঙ্গল কাব্যে', 1),
(1195, 295, 'ধর্মমঙ্গল কাব্যে', 0),
(1196, 296, 'ব্যক্তির মুক্তি', 0),
(1197, 296, 'সামাজিক মিথস্ক্রিয়া', 1),
(1198, 296, 'অন্ত্যেবাসী মানুষ', 0),
(1199, 296, 'শ্রেণিদ্বন্দ্ব', 0),
(1200, 297, 'ভাঁডুদত্ত', 0),
(1201, 297, 'চাঁদ সওদাগর', 0),
(1202, 297, 'ঈশ্বরী পাটনী', 1),
(1203, 297, 'মহুয়া', 0),
(1204, 298, 'মনসামঙ্গল', 0),
(1205, 298, 'চন্ডীমঙ্গল', 1),
(1206, 298, 'অন্নদাসমঙ্গল', 0),
(1207, 298, 'ধর্ম মঙ্গল', 0),
(1208, 299, 'দ্বিজ বংশীদাস', 0),
(1209, 299, 'চন্দ্রাবর্তী', 0),
(1210, 299, 'ভারতচন্দ্র রায়গুণাকর', 1),
(1211, 299, 'কানাহরি দত্ত', 0),
(1212, 300, 'চণ্ডীমঙ্গল কাব্যের কালকেতু উপাখ্যান', 1),
(1213, 300, 'অন্নদামঙ্গল কাব্যের মানসিংহ ভাবনন্দ উপাখ্যান', 0),
(1214, 300, 'মনসামঙ্গল', 0),
(1215, 300, 'ধর্মমঙ্গল', 0),
(1216, 301, 'উপন্যাস', 0),
(1217, 301, 'প্রবন্ধ গ্রন্থ', 0),
(1218, 301, 'আত্মজীবনীমূলক গ্রন্থ', 1),
(1219, 301, 'নাটক', 0),
(1220, 302, 'শ্রীচৈতন্যদেব', 1),
(1221, 302, 'রামকৃষ্ণ পরমহংসদেব', 0),
(1222, 302, 'বিদ্যাপতি', 0),
(1223, 302, 'কাহ্নপা', 0),
(1224, 303, 'ধর্মমঙ্গল', 0),
(1225, 303, 'জঙ্গনামা', 0),
(1226, 303, 'শ্রীকৃষ্ণকীর্তন', 0),
(1227, 303, 'চৈতন্যমঙ্গল', 1),
(1228, 304, 'বিধ্বস্ত নীলিমা', 0),
(1229, 304, 'কালে ধুলোয় খেলা', 1),
(1230, 304, 'নিজ বাসভুমে', 0),
(1231, 304, 'বন্দী শিবির থেকে', 0),
(1232, 305, 'বৃন্দাবন দাস', 1),
(1233, 305, 'লোচন দাস', 0),
(1234, 305, 'জয়ানন্দ', 0),
(1235, 305, 'পরাগল খাঁ', 0),
(1236, 306, 'কৃষ্ণদাস কবারাজ', 1),
(1237, 306, 'জয়ানন্দ', 0),
(1238, 306, 'বৃন্দাবন দাস', 0),
(1239, 306, 'কবি কর্ণপুর পরামানন্দ', 0),
(1240, 307, 'কেশব চন্দ্র সেন', 0),
(1241, 307, 'গিরিশচন্দ্র সেন', 1),
(1242, 307, 'মাওলানা মনিরুজ্জামান ইসলামাবাদী', 0),
(1243, 307, 'মওলানা আকরাম খাঁ', 0),
(1244, 308, 'দৌলত উজির বাহরাম খান', 0),
(1245, 308, 'মাগন ঠাকুর', 0),
(1246, 308, 'আলাওল', 0),
(1247, 308, 'শাহ্‌ মুহম্মদ সগীর', 1),
(1248, 309, 'নলিনীকান্ত ভট্টশালী', 0),
(1249, 309, 'কাশীরাম দাস', 0),
(1250, 309, 'মালাধর বসু', 0),
(1251, 309, 'কৃত্তিবাস ওঝা', 1),
(1252, 310, 'মীর মোশাররফ হোসেন', 0),
(1253, 310, 'মাওলানা আকরাম খান', 0),
(1254, 310, 'মুহাম্মদ হাবিবুর রহমান', 0),
(1255, 310, 'গিরিশচন্দ্র সেন', 1),
(1256, 311, 'প্রাচীন যুগে', 0),
(1257, 311, 'মধ্য যুগে', 1),
(1258, 311, 'আধুনিক যুগের প্রারম্ভে', 0),
(1259, 311, 'আধুনিক যুগের মধ্যভাগে', 0),
(1260, 311, 'কোনোটিই নয়', 0),
(1261, 312, 'প্রাচীন যুগে', 0),
(1262, 312, 'মধ্যযুগে', 1),
(1263, 312, 'আধুনিক যুগের প্রারম্ভে', 0),
(1264, 312, 'আধুনিক যুগের মধ্যযুগে', 0),
(1265, 312, 'কোনটিই নয়', 0),
(1266, 313, 'ডব্লিউ বি ইয়েটস', 0),
(1267, 313, 'ক্লিনটন বি সিলি', 1),
(1268, 313, 'অরুন্ধতী রায়', 0),
(1269, 313, 'অমিতাভ ঘোষ', 0),
(1270, 314, 'উপন্যাস', 0),
(1271, 314, 'ছোটড়ল্প', 0),
(1272, 314, 'প্রবন্ধ', 0),
(1273, 314, 'অনুবাদক নাটক', 1),
(1274, 315, 'মুনিদত্ত', 0),
(1275, 315, 'প্রবোধচন্দ্র বাগচী', 0),
(1276, 315, 'কীর্তিচন্দ্ৰ', 1),
(1277, 315, 'হরপ্রসাদ শাস্ত্রী', 0),
(1278, 316, 'মুনীর চৌধুরী', 0),
(1279, 316, 'কবীর চৌধুরী', 0),
(1280, 316, 'সৈয়দ আলী আহসান', 1),
(1281, 316, 'লিলি চৌধুরী', 0),
(1282, 317, 'দুশান জাজবিভেল', 1),
(1283, 317, 'ইমরে কারতেজঙ্গ', 0),
(1284, 317, 'এলেন গিন্সবার্গ', 0),
(1285, 317, 'ইমানুয়েল জাসরিন', 0),
(1286, 318, 'কাশীরাম দাস', 1),
(1287, 318, 'ভারতচন্দ্র রায়গুণাকর', 0),
(1288, 318, 'কৃত্তিবাস ওঝা', 0),
(1289, 318, 'রামানন্দ ঘোষ', 0),
(1290, 319, 'মার্চেন্ট অব ভেনিস', 0),
(1291, 319, 'কমেডি অব এররস', 1),
(1292, 319, 'এ মিডসামার নাইট\'স ড্রিম', 0),
(1293, 319, 'টেমিং অব দি শ্রু', 0),
(1294, 320, 'সঞ্জয়', 0),
(1295, 320, 'কবীন্দ্র পরমেশ্বর', 1),
(1296, 320, 'শ্রীকর নন্দী', 0),
(1297, 320, 'কাশীরাম দাস', 0),
(1298, 321, 'প্রফেসর সালাউদ্দিন আহমেদ', 0),
(1299, 321, 'প্রফেসর এম এন সিদ্দীক', 0),
(1300, 321, 'প্রফেসর শামসুল হুদা', 0),
(1301, 321, 'প্রফেসর ফকরুল আলম', 1),
(1302, 322, 'মোহিতলাল মজুমদার', 0),
(1303, 322, 'ঈশ্বচন্দ্র বিদ্যাসাগর', 1),
(1304, 322, 'রবীন্দ্রনাথ ঠাকুর', 0),
(1305, 322, 'কোনটিই নয়', 0),
(1306, 323, 'উপন্যাস', 0),
(1307, 323, 'ছোটগল্প', 0),
(1308, 323, 'প্রবন্ধ', 0),
(1309, 323, 'অনুবাদ নাটক', 1),
(1310, 324, '২ প্রকার', 1),
(1311, 324, '৩ প্রকার', 0),
(1312, 324, '৪ প্রকার', 0),
(1313, 324, '৫ প্রকার', 0),
(1314, 325, 'দৌলত উজির বাহরাম খাঁ', 0),
(1315, 325, 'আলাওল', 0),
(1316, 325, 'সৈয়দ সুলতান', 0),
(1317, 325, 'শাহ মুহম্মদ সগীর', 1),
(1318, 326, 'রবীন্দ্রনাথ ঠাকুর', 1),
(1319, 326, 'বিষ্ণু দে', 0),
(1320, 326, 'সুধীন্দ্রনাথ ঠাকুর', 0),
(1321, 326, 'বুদ্ধদেব বসু', 0),
(1322, 327, 'পদ্মবতী', 1),
(1323, 327, 'সয়ফুলমূলক -বদিউজ্জামাল', 0),
(1324, 327, 'হপ্তপয়কর', 0),
(1325, 327, 'তোহ্ফা', 0),
(1326, 328, 'নাটক', 0),
(1327, 328, 'উপন্যাস', 0),
(1328, 328, 'রোমন্টিক প্রণয় কাব্য', 1),
(1329, 328, 'রম্যরচনা', 0),
(1330, 329, 'নাটক', 0),
(1331, 329, 'উপন্যাস', 0),
(1332, 329, 'রোমান্টিক কাব্য', 1),
(1333, 329, 'রম্য রচনা', 0),
(1334, 330, 'নাটক', 0),
(1335, 330, 'উপন্যাস', 0),
(1336, 330, 'রোমান্টিক প্রণয়কাব্য', 1),
(1337, 330, 'রম্যরচনা', 0),
(1338, 331, 'পদ্মাবতী', 1),
(1339, 331, 'চন্দ্রাবতী', 0),
(1340, 331, 'কাজল রেখা', 0),
(1341, 331, 'কঙ্ক ও লীলা', 0),
(1342, 332, 'দৌলত কাজী', 0),
(1343, 332, 'মুহম্মদ কবীর', 0),
(1344, 332, 'আলাওল', 1),
(1345, 332, 'সাবিরিদ খান', 0),
(1346, 333, 'খোয়াবনামা', 0),
(1347, 333, 'পদ্মাবতী', 1),
(1348, 333, 'গৃহদাহ', 0),
(1349, 333, 'মহাশ্মশান', 0),
(1350, 334, 'পদ্মাবতী', 1),
(1351, 334, 'হপ্ত পয়করা', 0),
(1352, 334, 'তোহফা', 0),
(1353, 334, 'সিকান্দরনামা', 0),
(1354, 335, 'যশোরাজ খান', 0),
(1355, 335, 'শাহ মুহম্মদ সগীর', 1),
(1356, 335, 'মীর মোশাররফ হোসেন', 0),
(1357, 335, 'বিজয় গুপ্ত', 0),
(1358, 336, 'গিয়াসউদ্দিন আজম শাহ', 1),
(1359, 336, 'আলাউদ্দিন হোসেন শাহ', 0),
(1360, 336, 'ফখরুদ্দিন মুবারক শাহ', 0),
(1361, 336, 'শামসউদ্দিন ইলিয়াস শাহ', 0),
(1362, 337, 'পদ্মাবতী', 1),
(1363, 337, 'হপ্তপয়কর', 0),
(1364, 337, 'সিকান্দরনামা', 0),
(1365, 337, 'তোহ্‌ফা', 0),
(1366, 338, 'নাটক', 0),
(1367, 338, 'রোমান্টিক প্রণয়োপাখ্যান', 1),
(1368, 338, 'উপন্যাস', 0),
(1369, 338, 'রম্যরচনা', 0),
(1370, 339, 'ইরানের রূপকথা', 1),
(1371, 339, 'আরবদেশের রূপকথা', 0),
(1372, 339, 'আল কোরআনের সুরা ইউসুফ', 0),
(1373, 339, 'কবির কাল্পনিক আখ্যান', 0),
(1374, 340, 'আগমনী গীতি', 0),
(1375, 340, 'শোকগীতি', 1),
(1376, 340, 'ধর্মগীতি', 0),
(1377, 340, 'ধর্মগীতি পল্লীগীতি', 0),
(1378, 341, 'আনন্দগীতি', 0),
(1379, 341, 'চমাকগীতি', 0),
(1380, 341, 'শোকগীতি', 1),
(1381, 341, 'পল্লীগীতি', 0),
(1382, 342, 'আরবি', 1),
(1383, 342, 'ফারসি', 0),
(1384, 342, 'উর্দু', 0),
(1385, 342, 'তুর্কি', 0),
(1386, 343, 'শোক', 1),
(1387, 343, 'প্রকৃতি', 0),
(1388, 343, 'সৌন্দর্য', 0),
(1389, 343, 'আনন্দ', 0),
(1390, 344, 'শেখ ফয়জুল্লাহ', 0),
(1391, 344, 'দৌলতখাঁ', 0),
(1392, 344, 'আব্দুল হাকিম', 1),
(1393, 344, 'আব্দুল করিম', 0),
(1394, 345, 'উর্দু', 0),
(1395, 345, 'সংস্কৃত', 0),
(1396, 345, 'ফারসি', 0),
(1397, 345, 'আরবি', 1),
(1398, 346, 'মধুমালতী', 0),
(1399, 346, 'চন্দ্রাবতী', 0),
(1400, 346, 'লায়লী- মজনু', 0),
(1401, 346, 'জঙ্গনামা', 1),
(1402, 347, '<p>Prick : Sew</p>', 0),
(1403, 347, '<p>Leader: Follow</p>', 1),
(1404, 347, '<p>Pin : Cushion</p>', 0),
(1405, 347, '<p>Baat: Ball</p>', 0);

-- --------------------------------------------------------

--
-- Table structure for table `sessions`
--

CREATE TABLE `sessions` (
  `id` varchar(255) NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `ip_address` varchar(45) DEFAULT NULL,
  `user_agent` text DEFAULT NULL,
  `payload` longtext NOT NULL,
  `last_activity` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `sessions`
--

INSERT INTO `sessions` (`id`, `user_id`, `ip_address`, `user_agent`, `payload`, `last_activity`) VALUES
('OO34tRqDa1bCDy46DXexws1N2PKZ6deKMYmSekSH', 2, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/146.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiQ2l6V0tETjRiM1pzYnE0c2lnSzd5SzRIQVdNZUpyVXdmSUpGR2xMayI7czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MzA6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMC9zL0lZSlJNUyI7czo1OiJyb3V0ZSI7czoxMToic3R1ZGVudEV4YW0iO31zOjUwOiJsb2dpbl93ZWJfNTliYTM2YWRkYzJiMmY5NDAxNTgwZjAxNGM3ZjU4ZWE0ZTMwOTg5ZCI7aToyO30=', 1775370295),
('PNviBAia97xc29lRP7yeXJKLKywCi6zaahMiQhvo', 2, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/146.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiWjhnRG5vRTVlckpDN0JzRUozM01HRUozMlh0c3VCZTg1d3ZreU5NRCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MzM6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMC9zL2Rhc2hib2FyZCI7czo1OiJyb3V0ZSI7czoxNjoic3R1ZGVudERhc2hib2FyZCI7fXM6NjoiX2ZsYXNoIjthOjI6e3M6Mzoib2xkIjthOjA6e31zOjM6Im5ldyI7YTowOnt9fXM6NTA6ImxvZ2luX3dlYl81OWJhMzZhZGRjMmIyZjk0MDE1ODBmMDE0YzdmNThlYTRlMzA5ODlkIjtpOjI7fQ==', 1775371600),
('RAZ98XaHlom7l2ER0uINTxT5tEYbuPIvFOytxpAM', 2, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/146.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoiZlk0S0lMYXV1RndpbWYyWExzSGNCbnZJeklBUmlsUDZJN0hjZlA0dSI7czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6MzM6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMC9zL2Rhc2hib2FyZCI7czo1OiJyb3V0ZSI7czoxMToic3R1ZGVudEV4YW0iO31zOjUwOiJsb2dpbl93ZWJfNTliYTM2YWRkYzJiMmY5NDAxNTgwZjAxNGM3ZjU4ZWE0ZTMwOTg5ZCI7aToyO30=', 1775371135),
('RcpC6kuPiWmvRAHItlSQVZIYM1dIkXH7zcRmM167', 2, '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/146.0.0.0 Safari/537.36', 'YTo0OntzOjY6Il90b2tlbiI7czo0MDoibUtkN3Y2RGtYWkdNWkhXbHhqQ0JodzN4bW8yeDhMV0pndW1JNUxUTCI7czo5OiJfcHJldmlvdXMiO2E6Mjp7czozOiJ1cmwiO3M6NDA6Imh0dHA6Ly8xMjcuMC4wLjE6ODAwMC90L3F1ZXN0aW9uLWJ1aWxkZXIiO3M6NToicm91dGUiO3M6MjA6InF1ZXN0aW9uQnVpbGRlckluZGV4Ijt9czo2OiJfZmxhc2giO2E6Mjp7czozOiJvbGQiO2E6MDp7fXM6MzoibmV3IjthOjA6e319czo1MDoibG9naW5fd2ViXzU5YmEzNmFkZGMyYjJmOTQwMTU4MGYwMTRjN2Y1OGVhNGUzMDk4OWQiO2k6Mjt9', 1775370174);

-- --------------------------------------------------------

--
-- Table structure for table `users`
--

CREATE TABLE `users` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `is_student` tinyint(4) NOT NULL,
  `email` varchar(255) DEFAULT NULL,
  `mobile` varchar(255) DEFAULT NULL,
  `email_verified_at` timestamp NULL DEFAULT NULL,
  `password` varchar(255) NOT NULL,
  `remember_token` varchar(100) DEFAULT NULL,
  `created_at` timestamp NULL DEFAULT NULL,
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Dumping data for table `users`
--

INSERT INTO `users` (`id`, `name`, `is_student`, `email`, `mobile`, `email_verified_at`, `password`, `remember_token`, `created_at`, `updated_at`) VALUES
(1, 'Test User', 0, 'test@example.com', NULL, '2026-02-17 23:58:29', '$2y$12$HXiXK4yGNd0SejtZfXdwrOSccmEKjq8l7vsiWt5XNRSbhYsmxVWqC', '7o38pkMAGqXjgL3jrQrPR660qRMHF6q2YaAqPjKrr6N2YLxMvWEJc4wUGZCT', '2026-02-17 23:58:30', '2026-02-17 23:58:30'),
(2, 'বৈষ্ণব পদাবলি', 1, NULL, '01953240076', NULL, '$2y$12$xiM1eabqMQivuqAcWkamJeZrQTiq2WEluMixPmiIZ9rkiKpU.TdBO', NULL, '2026-03-19 01:54:23', '2026-04-05 00:31:20');

-- --------------------------------------------------------

--
-- Table structure for table `user_answers`
--

CREATE TABLE `user_answers` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_attempt_id` bigint(20) UNSIGNED NOT NULL,
  `exam_id` bigint(20) UNSIGNED NOT NULL,
  `question_id` bigint(20) UNSIGNED NOT NULL,
  `selected_option_id` bigint(20) UNSIGNED DEFAULT NULL,
  `correct_option_id` bigint(20) UNSIGNED NOT NULL,
  `is_correct` tinyint(1) DEFAULT 0,
  `question_mark` decimal(8,2) DEFAULT 0.00,
  `obtained_mark` decimal(8,2) DEFAULT 0.00,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user_answers`
--

INSERT INTO `user_answers` (`id`, `user_attempt_id`, `exam_id`, `question_id`, `selected_option_id`, `correct_option_id`, `is_correct`, `question_mark`, `obtained_mark`, `created_at`, `updated_at`) VALUES
(18, 1, 9, 6, 22, 22, 1, 1.00, 1.00, '2026-04-05 00:35:32', '2026-04-05 00:35:32');

-- --------------------------------------------------------

--
-- Table structure for table `user_attempts`
--

CREATE TABLE `user_attempts` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `user_id` bigint(20) UNSIGNED DEFAULT NULL,
  `exam_id` bigint(20) UNSIGNED NOT NULL,
  `name` varchar(255) NOT NULL,
  `mobile` varchar(20) NOT NULL,
  `total_questions` int(11) DEFAULT 0,
  `answered_questions` int(11) DEFAULT 0,
  `correct_answers` int(11) DEFAULT 0,
  `wrong_answers` int(11) DEFAULT 0,
  `skipped_questions` int(11) DEFAULT 0,
  `right_answer_mark` decimal(8,2) DEFAULT 0.00,
  `wrong_answer_mark` decimal(8,2) DEFAULT 0.00,
  `obtained_marks` decimal(8,2) DEFAULT 0.00,
  `submitted_at` timestamp NULL DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NOT NULL DEFAULT current_timestamp() ON UPDATE current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `user_attempts`
--

INSERT INTO `user_attempts` (`id`, `user_id`, `exam_id`, `name`, `mobile`, `total_questions`, `answered_questions`, `correct_answers`, `wrong_answers`, `skipped_questions`, `right_answer_mark`, `wrong_answer_mark`, `obtained_marks`, `submitted_at`, `created_at`, `updated_at`) VALUES
(1, 2, 9, 'বৈষ্ণব পদাবলি', '01953240076', 15, 1, 1, 0, 14, 1.00, 0.00, 1.00, '2026-04-05 00:35:32', '2026-03-19 06:34:07', '2026-04-05 00:35:32');

-- --------------------------------------------------------

--
-- Table structure for table `years`
--

CREATE TABLE `years` (
  `id` bigint(30) NOT NULL,
  `title` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp(),
  `updated_at` timestamp NULL DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `years`
--

INSERT INTO `years` (`id`, `title`, `created_at`, `updated_at`) VALUES
(2, '2025', '2026-03-04 17:07:20', '2026-03-04 18:48:06'),
(3, '2026', '2026-03-04 18:47:32', '2026-03-04 18:47:32'),
(4, '2024', '2026-03-04 18:48:11', '2026-03-04 18:48:11'),
(5, '2023', '2026-03-04 18:48:18', '2026-03-04 18:48:18'),
(6, '2022', '2026-03-04 18:48:25', '2026-03-04 18:48:25'),
(7, '2021', '2026-03-04 18:48:32', '2026-03-04 18:48:32'),
(8, '2020', '2026-03-04 18:48:38', '2026-03-04 18:48:38'),
(9, '2019', '2026-03-04 18:48:43', '2026-03-04 18:48:43'),
(10, '2018', '2026-03-04 18:48:49', '2026-03-04 18:48:49'),
(11, '2017', '2026-03-04 18:48:53', '2026-03-04 18:48:53'),
(12, '2016', '2026-03-04 18:49:01', '2026-03-04 18:49:01'),
(13, '2015', '2026-03-04 18:49:06', '2026-03-04 18:49:06'),
(14, '2014', '2026-03-04 18:49:22', '2026-03-04 18:49:22'),
(15, '2013', '2026-03-04 18:49:26', '2026-03-04 18:49:26'),
(16, '2012', '2026-03-04 18:49:32', '2026-03-04 18:49:32'),
(17, '2011', '2026-03-04 18:49:41', '2026-03-04 18:49:41'),
(18, '2010', '2026-03-04 18:49:49', '2026-03-04 18:49:49'),
(19, '2009', '2026-03-04 18:49:55', '2026-03-04 18:49:55'),
(20, '2008', '2026-03-04 18:50:00', '2026-03-04 18:50:00'),
(21, '2007', '2026-03-04 18:50:04', '2026-03-04 18:50:04'),
(22, '2006', '2026-03-04 18:50:09', '2026-03-04 18:50:09'),
(23, '2005', '2026-03-04 18:50:16', '2026-03-04 18:50:16'),
(24, '2004', '2026-03-04 18:50:21', '2026-03-04 18:50:21'),
(25, '2003', '2026-03-04 18:50:29', '2026-03-04 18:50:29'),
(26, '2002', '2026-03-04 18:50:34', '2026-03-04 18:50:34'),
(27, '2001', '2026-03-04 18:50:38', '2026-03-04 18:50:38'),
(28, '2000', '2026-03-04 18:50:43', '2026-03-04 18:50:43');

-- --------------------------------------------------------

--
-- Table structure for table `year_question`
--

CREATE TABLE `year_question` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `year_id` bigint(20) UNSIGNED NOT NULL,
  `question_id` bigint(20) UNSIGNED NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Dumping data for table `year_question`
--

INSERT INTO `year_question` (`id`, `year_id`, `question_id`) VALUES
(31, 2, 317),
(32, 2, 320),
(33, 2, 323),
(27, 2, 329),
(28, 2, 333),
(29, 2, 334),
(30, 2, 338),
(23, 2, 340),
(24, 2, 341),
(25, 2, 345),
(26, 2, 346),
(35, 2, 347);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `access_roles`
--
ALTER TABLE `access_roles`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `slug` (`slug`);

--
-- Indexes for table `access_role_user`
--
ALTER TABLE `access_role_user`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_user_access_role` (`user_id`,`access_role_id`),
  ADD KEY `fk_aru_role` (`access_role_id`);

--
-- Indexes for table `cache`
--
ALTER TABLE `cache`
  ADD PRIMARY KEY (`key`),
  ADD KEY `cache_expiration_index` (`expiration`);

--
-- Indexes for table `cache_locks`
--
ALTER TABLE `cache_locks`
  ADD PRIMARY KEY (`key`),
  ADD KEY `cache_locks_expiration_index` (`expiration`);

--
-- Indexes for table `exams`
--
ALTER TABLE `exams`
  ADD PRIMARY KEY (`id`),
  ADD KEY `created_by` (`created_by`);

--
-- Indexes for table `exam_answers`
--
ALTER TABLE `exam_answers`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_exam_answer` (`exam_id`,`question_id`),
  ADD KEY `fk_ea_question` (`question_id`);

--
-- Indexes for table `exam_questions`
--
ALTER TABLE `exam_questions`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_exam_question` (`exam_id`,`question_id`),
  ADD KEY `exam_id` (`exam_id`),
  ADD KEY `question_id` (`question_id`);

--
-- Indexes for table `exam_settings`
--
ALTER TABLE `exam_settings`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `uq_exam_settings` (`exam_id`);

--
-- Indexes for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `failed_jobs_uuid_unique` (`uuid`);

--
-- Indexes for table `jobs`
--
ALTER TABLE `jobs`
  ADD PRIMARY KEY (`id`),
  ADD KEY `jobs_queue_index` (`queue`);

--
-- Indexes for table `job_batches`
--
ALTER TABLE `job_batches`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `migrations`
--
ALTER TABLE `migrations`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `negative_marks`
--
ALTER TABLE `negative_marks`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `password_reset_tokens`
--
ALTER TABLE `password_reset_tokens`
  ADD PRIMARY KEY (`email`);

--
-- Indexes for table `previous_exams`
--
ALTER TABLE `previous_exams`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `previous_exam_categories`
--
ALTER TABLE `previous_exam_categories`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `previous_exam_questions`
--
ALTER TABLE `previous_exam_questions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `idx_prev_exam_id` (`previous_exam_id`),
  ADD KEY `idx_question_id` (`question_id`);

--
-- Indexes for table `questions`
--
ALTER TABLE `questions`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `question_categories`
--
ALTER TABLE `question_categories`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `slug` (`slug`),
  ADD KEY `fk_question_category_parent` (`parent_category_id`);

--
-- Indexes for table `question_options`
--
ALTER TABLE `question_options`
  ADD PRIMARY KEY (`id`),
  ADD KEY `question_id` (`question_id`);

--
-- Indexes for table `sessions`
--
ALTER TABLE `sessions`
  ADD PRIMARY KEY (`id`),
  ADD KEY `sessions_user_id_index` (`user_id`),
  ADD KEY `sessions_last_activity_index` (`last_activity`);

--
-- Indexes for table `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `users_email_unique` (`email`);

--
-- Indexes for table `user_answers`
--
ALTER TABLE `user_answers`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `user_attempts`
--
ALTER TABLE `user_attempts`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `years`
--
ALTER TABLE `years`
  ADD PRIMARY KEY (`id`);

--
-- Indexes for table `year_question`
--
ALTER TABLE `year_question`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `year_question_unique` (`year_id`,`question_id`),
  ADD KEY `idx_year_question_year` (`year_id`),
  ADD KEY `idx_year_question_question` (`question_id`);

--
-- AUTO_INCREMENT for dumped tables
--

--
-- AUTO_INCREMENT for table `access_roles`
--
ALTER TABLE `access_roles`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `access_role_user`
--
ALTER TABLE `access_role_user`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `exams`
--
ALTER TABLE `exams`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=10;

--
-- AUTO_INCREMENT for table `exam_answers`
--
ALTER TABLE `exam_answers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `exam_questions`
--
ALTER TABLE `exam_questions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=41;

--
-- AUTO_INCREMENT for table `exam_settings`
--
ALTER TABLE `exam_settings`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `failed_jobs`
--
ALTER TABLE `failed_jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `jobs`
--
ALTER TABLE `jobs`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT;

--
-- AUTO_INCREMENT for table `migrations`
--
ALTER TABLE `migrations`
  MODIFY `id` int(10) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- AUTO_INCREMENT for table `negative_marks`
--
ALTER TABLE `negative_marks`
  MODIFY `id` bigint(20) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=5;

--
-- AUTO_INCREMENT for table `previous_exams`
--
ALTER TABLE `previous_exams`
  MODIFY `id` bigint(30) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT for table `previous_exam_categories`
--
ALTER TABLE `previous_exam_categories`
  MODIFY `id` bigint(30) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=14;

--
-- AUTO_INCREMENT for table `previous_exam_questions`
--
ALTER TABLE `previous_exam_questions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `questions`
--
ALTER TABLE `questions`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=348;

--
-- AUTO_INCREMENT for table `question_categories`
--
ALTER TABLE `question_categories`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=22;

--
-- AUTO_INCREMENT for table `question_options`
--
ALTER TABLE `question_options`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=1406;

--
-- AUTO_INCREMENT for table `users`
--
ALTER TABLE `users`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT for table `user_answers`
--
ALTER TABLE `user_answers`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=19;

--
-- AUTO_INCREMENT for table `user_attempts`
--
ALTER TABLE `user_attempts`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=2;

--
-- AUTO_INCREMENT for table `years`
--
ALTER TABLE `years`
  MODIFY `id` bigint(30) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=29;

--
-- AUTO_INCREMENT for table `year_question`
--
ALTER TABLE `year_question`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=36;

--
-- Constraints for dumped tables
--

--
-- Constraints for table `access_role_user`
--
ALTER TABLE `access_role_user`
  ADD CONSTRAINT `fk_aru_role` FOREIGN KEY (`access_role_id`) REFERENCES `access_roles` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `fk_aru_user` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
